rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    app_ai.c
 * @brief   Minimal AI runtime bootstrap helpers.
 ******************************************************************************
 */
/* USER CODE END Header */

#include "app_ai.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stddef.h>
#include <string.h>
#include <stdint.h>
#include <stdio.h>

#include "debug_console.h"
#include "app_inference_calibration.h"
#include "app_inference_log_utils.h"
#define LL_ATON_PLATFORM LL_ATON_PLAT_STM32N6
#define LL_ATON_OSAL LL_ATON_OSAL_THREADX
#include "tx_api.h"
#include "ll_aton_rt_user_api.h"
#include "ll_aton.h"
#include "ll_aton_runtime.h"
#include "app_filex.h"
#include "stm32n6xx_nucleo_xspi.h"
#include "npu_cache.h"
#include "stm32n6xx_hal.h"

/*
 * The AI bring-up path is very verbose in Debug builds and the format strings
 * alone can overflow the internal ROM region. Keep the model execution path
 * intact, but compile the per-step console chatter out unless a developer
 * explicitly re-enables it for a size-debugging session.
 */
#ifndef APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
#define APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS 0
#endif
#if !APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
#undef DebugConsole_Printf
#define DebugConsole_Printf(...) ((void) 0)
#undef DebugConsole_WriteString
#define DebugConsole_WriteString(...) ((void) 0)
#endif
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define APP_AI_CACHE_LINE_BYTES 32U
#define APP_AI_CAPTURE_FRAME_WIDTH_PIXELS 224U
#define APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS 224U
#define APP_AI_CAPTURE_FRAME_BYTES_PER_PIXEL 2U
#define APP_AI_CAPTURE_FRAME_BYTES \
		(APP_AI_CAPTURE_FRAME_WIDTH_PIXELS * APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS \
				* APP_AI_CAPTURE_FRAME_BYTES_PER_PIXEL)
#define APP_AI_MODEL_INPUT_FLOAT_COUNT \
		(APP_AI_CAPTURE_FRAME_WIDTH_PIXELS * APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS \
				* 3U)
/* Bright-object detector threshold used to find the gauge face before
 * cropping and resizing the tensor. 80 was a better fit than 60 on captured
 * frames because 60 was too loose and pulled in most of the background. */
#define APP_AI_GAUGE_BRIGHT_THRESHOLD      80U
/* Ignore a thin border while estimating the bright bbox so edge glare does not
 * drag the crop to x=0 or y=0. */
#define APP_AI_GAUGE_CROP_BORDER_PIXELS    16U
/* The newest live board captures want a slightly tighter crop that is biased
 * left of the bright centroid. That keeps more of the dial face in frame and
 * reduces the background washout that was pulling the prod model low. */
#define APP_AI_GAUGE_CROP_WIDTH_SCALE_NUMERATOR    17U
#define APP_AI_GAUGE_CROP_WIDTH_SCALE_DENOMINATOR  20U
#define APP_AI_GAUGE_CROP_HEIGHT_SCALE_NUMERATOR   17U
#define APP_AI_GAUGE_CROP_HEIGHT_SCALE_DENOMINATOR 20U
#define APP_AI_GAUGE_CROP_CENTER_X_BIAS_PIXELS      24U
#define APP_AI_GAUGE_CROP_CENTER_Y_BIAS_PIXELS       0U
/* The current close-up board captures drift too far downward with the
 * adaptive rectifier and miss the needle on low temperatures. Use the stable
 * training crop on-device until we retrain on the closer framing. */
#define APP_AI_USE_ADAPTIVE_GAUGE_CROP      0U
/* Feed the model a stable grayscale tensor from Y luma only.
 * The RGB reconstruction path was collapsing to a green-only tensor on board,
 * which is a worse mismatch than replicated luminance for this gauge task. */
#define APP_AI_YUV422_INPUT_LUMA_ONLY      1U
/* Dataset-wide mean dial crop from the CVAT boxes used during training. */
#define APP_AI_TRAINING_CROP_X_MIN_RATIO   0.1027f
#define APP_AI_TRAINING_CROP_Y_MIN_RATIO   0.2573f
#define APP_AI_TRAINING_CROP_X_MAX_RATIO   0.7987f
#define APP_AI_TRAINING_CROP_Y_MAX_RATIO   0.8071f
#define APP_AI_MODEL_INPUT_FLOAT_BYTES \
		(APP_AI_MODEL_INPUT_FLOAT_COUNT * sizeof(float))
#define APP_AI_MODEL_OUTPUT_FLOAT_BYTES   sizeof(float)
#define APP_AI_SCALAR_XSPI2_MODEL_IMAGE_PATH "atonbuf.xSPI2.raw"
#define APP_AI_RECTIFIER_XSPI2_MODEL_IMAGE_PATH \
		"atonbuf.rectifier.xSPI2.raw"
#define APP_AI_XSPI2_MODEL_IMAGE_PATH     APP_AI_SCALAR_XSPI2_MODEL_IMAGE_PATH
#define APP_AI_XSPI2_PROGRAM_CHUNK_BYTES   4096U
#define APP_AI_XSPI2_ERASE_BLOCK_BYTES     (64U * 1024U)
#define APP_AI_XSPI2_PROBE_BYTES           16U
/* Keep the rectifier crop slightly larger than the raw box so the scalar head
 * still sees the needle and a bit of surrounding dial context. */
#define APP_AI_RECTIFIER_CROP_SCALE        1.25f
/* Match the Python rectifier evaluator: never let the predicted box collapse
 * below a tiny fraction of the canvas, or the scalar stage degenerates to a
 * 1x1 crop. */
#define APP_AI_RECTIFIER_MIN_BOX_RATIO     0.05f
/* Rectifier crops outside this band are usually unhelpful on live board
 * captures, so fall back to the stable training crop instead of trusting them. */
#define APP_AI_RECTIFIER_FALLBACK_MIN_BOX_RATIO  0.25f
#define APP_AI_RECTIFIER_FALLBACK_MAX_BOX_RATIO  0.95f
/* Temporarily disable EMA smoothing so the board exposes the raw model value
 * directly while we validate the current crop and exposure tuning. */
#define APP_AI_INFERENCE_SMOOTHING_ALPHA   1.0f
/* xSPI2 window base address (chip address 0). */
#define APP_AI_XSPI2_CHIP_BASE_ADDR       0x70000000UL
/* Scalar model: immediately after FSBL (0x70000000) + App (0x70100000, 1 MB
 * window). Must match FLASH_SCALAR address in flash_boot.bat.
 * Size: ~3.07 MB → occupies 0x70200000–0x7051FFFF (50 × 64 KB blocks). */
#define APP_AI_XSPI2_SCALAR_BASE_ADDR     0x70200000UL
#define APP_AI_XSPI2_SCALAR_CHIP_OFFSET   (APP_AI_XSPI2_SCALAR_BASE_ADDR - APP_AI_XSPI2_CHIP_BASE_ADDR)
/* Rectifier model: immediately after scalar region (aligned to next 64 KB).
 * Must match FLASH_RECTIFIER address in flash_boot.bat.
 * Size: ~118 KB → occupies 0x70520000–0x7053FFFF (2 × 64 KB blocks). */
#define APP_AI_XSPI2_RECTIFIER_BASE_ADDR  0x70520000UL
#define APP_AI_XSPI2_RECTIFIER_CHIP_OFFSET (APP_AI_XSPI2_RECTIFIER_BASE_ADDR - APP_AI_XSPI2_CHIP_BASE_ADDR)
/* Legacy alias used by the single-stage logging helpers; points to scalar. */
#define APP_AI_XSPI2_MODEL_BASE_ADDR      APP_AI_XSPI2_SCALAR_BASE_ADDR
#define APP_AI_XSPI2_MODEL_CHIP_OFFSET    APP_AI_XSPI2_SCALAR_CHIP_OFFSET
/* FileX can take a while to recover from card init retries or media errors.
 * Give the loader a longer window so we do not give up just before the stack
 * settles. */
#define APP_AI_FILEX_MEDIA_READY_TIMEOUT_MS 180000U
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN PV */
static bool app_ai_runtime_initialized = false;
static volatile float app_ai_last_inference_value = 0.0f;
static volatile bool app_ai_last_inference_valid = false;
static bool app_ai_inference_smoothing_initialized = false;
static float app_ai_inference_smoothed_value = 0.0f;
static bool app_ai_npu_hw_initialized = false;
static bool app_ai_xspi2_initialized = false;
static const struct AppAI_ModelStageSpec *app_ai_loaded_xspi2_stage = NULL;
static bool app_ai_forced_crop_active = false;
static size_t app_ai_forced_crop_x_min = 0U;
static size_t app_ai_forced_crop_y_min = 0U;
static size_t app_ai_forced_crop_width = 0U;
static size_t app_ai_forced_crop_height = 0U;
static const char *app_ai_forced_crop_label = NULL;
__attribute__((section(".xspi2_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_scalar_full_finetune_from_best_piecewise_calibrated_int8[32U] = {
	0U,
};
/* Rectifier pool placed in its own section so the linker script can map it to
 * the rectifier flash region at 0x70520000 — matching FLASH_RECTIFIER in
 * flash_boot.bat.  The NPU resolves all weight addresses as:
 *   _mem_pool_xSPI2_mobilenetv2_rectifier_hardcase_finetune + internal_offset
 * so this symbol MUST live at the base of the flashed blob. */
__attribute__((section(".xspi2_rectifier_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_mobilenetv2_rectifier_hardcase_finetune[32U] = {
	0U,
};
static uint8_t app_ai_xspi2_program_buffer[APP_AI_XSPI2_PROGRAM_CHUNK_BYTES];
/* Start/tail signatures for the current atonbuf.xSPI2.raw.
 * Update these when a new model is exported by running:
 *   python3 -c "
 *     d=open('st_ai_output/atonbuf.xSPI2.raw','rb').read()
 *     print('start:', bytes(d[:16]).hex())
 *     print('tail: ', bytes(d[-16:]).hex())" */
static const uint8_t app_ai_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0xEFU, 0x1BU, 0x2BU, 0xE0U, 0xD7U, 0xE6U, 0xECU, 0x06U,
	0x05U, 0x00U, 0x34U, 0xECU, 0x1AU, 0xDDU, 0x14U, 0x05U,
};
