rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
static const uint8_t app_ai_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0xE6U,
};
/* Rectifier v3 xSPI2 signatures used when the board boots with the rectifier
 * blob already flashed at 0x70200000. */
static const uint8_t app_ai_rectifier_xspi2_signature_start[
		APP_AI_XSPI2_PROBE_BYTES] = {
	0x0FU, 0x11U, 0xF8U, 0x10U, 0xD0U, 0xD8U, 0x0EU, 0x28U,
	0x99U, 0xCDU, 0x98U, 0x7DU, 0xBCU, 0x43U, 0x5EU, 0xF2U,
};
static const uint8_t app_ai_rectifier_xspi2_signature_tail[
		APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x80U,
};
/* Per-stage programmed sizes. Set during provisioning and used by the verify
 * functions for the tail probe offset. Keeping them separate prevents the
 * scalar tail check from using the rectifier's file size (or vice-versa) when
 * stages alternate. */
static ULONG app_ai_scalar_programmed_size = 0UL;
static ULONG app_ai_rectifier_programmed_size = 0UL;
/* Legacy alias kept so existing references still compile; points to the scalar
 * size which was the only stage before the rectifier was added. */
static ULONG app_ai_xspi2_programmed_size = 0UL;

/* Per-stage signature caches populated from the SD file during provisioning.
 * Using SD-sourced bytes means verify never goes stale when the model blob is
 * replaced, regardless of what the hardcoded fallback constants say. */
static uint8_t app_ai_scalar_sig_start[APP_AI_XSPI2_PROBE_BYTES] = { 0U };
static uint8_t app_ai_scalar_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = { 0U };
static bool    app_ai_scalar_sig_valid = false;
static uint8_t app_ai_rectifier_sig_start[APP_AI_XSPI2_PROBE_BYTES] = { 0U };
static uint8_t app_ai_rectifier_sig_tail[APP_AI_XSPI2_PROBE_BYTES] = { 0U };
static bool    app_ai_rectifier_sig_valid = false;

/* Declare the generated NN instance locally so the dry-run helper can run the
 * AtoNN runtime on the exact network produced by Cube.AI. */
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(
		scalar_full_finetune_from_best_piecewise_calibrated_int8);
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(
		mobilenetv2_rectifier_hardcase_finetune);

typedef struct AppAI_ModelStageSpec AppAI_ModelStageSpec;

struct AppAI_ModelStageSpec {
	const char *stage_label;
	const char *model_image_path;
	NN_Instance_TypeDef *nn_instance;
	bool (*network_init_fn)(void);
	bool (*inference_init_fn)(void);
	bool uses_rectifier_box;
	uint32_t xspi2_chip_offset; /* byte offset from chip base (0x70000000) */
	uint32_t xspi2_base_addr;   /* mapped window address for this stage */
};

typedef struct {
	float center_x;
	float center_y;
	float box_w;
	float box_h;
} AppAI_RectifierBox;

typedef struct {
	size_t x_min;
	size_t y_min;
	size_t width;
	size_t height;
} AppAI_SourceCrop;

static const AppAI_ModelStageSpec app_ai_scalar_stage = {
	.stage_label = "scalar",
	.model_image_path = APP_AI_SCALAR_XSPI2_MODEL_IMAGE_PATH,
	.nn_instance = &NN_Instance_scalar_full_finetune_from_best_piecewise_calibrated_int8,
	.network_init_fn =
			LL_ATON_EC_Network_Init_scalar_full_finetune_from_best_piecewise_calibrated_int8,
	.inference_init_fn =
			LL_ATON_EC_Inference_Init_scalar_full_finetune_from_best_piecewise_calibrated_int8,
	.uses_rectifier_box = false,
	.xspi2_chip_offset = APP_AI_XSPI2_SCALAR_CHIP_OFFSET,
	.xspi2_base_addr   = APP_AI_XSPI2_SCALAR_BASE_ADDR,
};

static const AppAI_ModelStageSpec app_ai_rectifier_stage = {
	.stage_label = "rectifier",
	.model_image_path = APP_AI_RECTIFIER_XSPI2_MODEL_IMAGE_PATH,
	.nn_instance = &NN_Instance_mobilenetv2_rectifier_hardcase_finetune,
	.network_init_fn =
			LL_ATON_EC_Network_Init_mobilenetv2_rectifier_hardcase_finetune,
	.inference_init_fn =
			LL_ATON_EC_Inference_Init_mobilenetv2_rectifier_hardcase_finetune,
	.uses_rectifier_box = true,
	.xspi2_chip_offset = APP_AI_XSPI2_RECTIFIER_CHIP_OFFSET,
	.xspi2_base_addr   = APP_AI_XSPI2_RECTIFIER_BASE_ADDR,
};
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN PFP */
static const LL_Buffer_InfoTypeDef *AppAI_GetInputBufferInfo(void);
static const LL_Buffer_InfoTypeDef *AppAI_GetOutputBufferInfo(void);
static const LL_Buffer_InfoTypeDef *AppAI_FindBufferInfoByName(
		const LL_Buffer_InfoTypeDef *buffer_list, const char *name);
static const LL_Buffer_InfoTypeDef *AppAI_FindFirstBufferInfoByNames(
		const LL_Buffer_InfoTypeDef *buffer_list, const char *const *names,
		size_t name_count);
static void AppAI_LogInitFailure(const char *step);
static void AppAI_LogXspi2LoadFailure(const char *step, UINT fx_status,
		int32_t bsp_status);
static void AppAI_LogXspi2ProgramChunkProgress(ULONG chunk_index,
		ULONG flash_offset, ULONG chunk_size);
static void AppAI_LogXspi2FlashStatus(const char *label);
static void AppAI_LogXspi2PrefixBytes(const char *label,
		const uint8_t *bytes);
static void AppAI_LogFrameSignature(const uint8_t *frame_bytes,
		size_t frame_size);
static void AppAI_LogInputSignature(const float *input_buffer,
		size_t input_float_count);
static void AppAI_LogInputTensorWindow(const float *input_buffer,
		size_t input_float_count);
static void AppAI_LogInputProbeSummary(const float *input_buffer,
		size_t input_float_count);
static void AppAI_LogTensorRowSamples(const char *label,
		const float *input_buffer, size_t tensor_width, size_t row_y,
		size_t x_min, size_t x_max);
static void AppAI_LogSourcePatch(const char *label, const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t center_x, size_t center_y,
		size_t radius_pixels);
static void AppAI_LogTensorPatch(const char *label, const float *input_buffer,
		size_t tensor_width, size_t center_x, size_t center_y,
		size_t radius_pixels);
static void AppAI_LogSourceCropWindow(const uint8_t *frame_bytes,
		size_t frame_size, size_t frame_width_pixels, size_t frame_height_pixels,
		size_t crop_x_min, size_t crop_y_min, size_t crop_width,
		size_t crop_height);
static void AppAI_LogInt8BufferSignature(const char *label,
		const int8_t *buffer_ptr, size_t buffer_len_bytes);
static void AppAI_LogRawBufferSignature(const char *label,
		const uint8_t *buffer_ptr, size_t buffer_len_bytes);
static const char *AppAI_BufferTypeName(const LL_Buffer_InfoTypeDef *buffer_info);
static void AppAI_LogBufferInfoAndSignature(const char *label,
		const LL_Buffer_InfoTypeDef *buffer_info);
static bool AppAI_EstimateGaugeCropBoxFromYuv422(const uint8_t *frame_bytes,
		size_t frame_size, size_t frame_width_pixels, size_t frame_height_pixels,
		size_t *crop_x_min, size_t *crop_y_min, size_t *crop_width,
		size_t *crop_height);
static bool AppAI_LogXspi2ModelFilePrefix(FX_FILE *model_file_ptr);
static void AppAI_LogXspi2FlashPrefix(void);
static void AppAI_LogXspi2MappedScaleBytes(void);
static void AppAI_LogXspi2IndirectAndMappedPrefix(void);
static void AppAI_LogFloatApprox(const char *label, float value);
static float AppAI_FilterInferenceValue(float value);
static void AppAI_LogInferenceResult(
		const LL_Buffer_InfoTypeDef *output_buffer_info);
static void AppAI_LogRectifierResult(
		const LL_Buffer_InfoTypeDef *output_buffer_info,
		const AppAI_RectifierBox *rectifier_box);
static int AppAI_ApplyCacheRange(uint32_t start_addr, uint32_t end_addr,
		bool clean, bool invalidate);
static void AppAI_EnableNpuMemoryAndCaches(void);
static void AppAI_ConfigureNpuAccessControl(void);
static void AppAI_ConfigureNpuRisafDefaults(void);
static bool AppAI_EnsureXspi2ModelImageReady(void);
static bool AppAI_Xspi2ModelImageMatchesFlash(void);
static bool AppAI_ProgramXspi2ModelImageFromSd(void);
static bool AppAI_EnsureStageRuntimeReady(const AppAI_ModelStageSpec *stage);
static bool AppAI_EnsureXspi2ModelImageReadyForStage(
		const AppAI_ModelStageSpec *stage);
static bool AppAI_ProgramXspi2ModelImageFromSdForStage(
		const AppAI_ModelStageSpec *stage);
static bool AppAI_WaitForFileXMediaReady(uint32_t timeout_ms);
static bool AppAI_RuntimeInitStepwise(void);
static bool AppAI_PreprocessYuv422FrameToFloatInput(const uint8_t *frame_bytes,
		size_t frame_size, float *input_buffer, size_t input_float_count);
static float AppAI_ClampNormalizedFloat(float value);
static uint8_t AppAI_ReadYuv422Luma(const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t source_x, size_t source_y);
static void AppAI_ReadYuv422Quartet(const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t source_x, size_t source_y,
		uint8_t *quad_out);
static float AppAI_ReadNormalizedGrayFromYuv422Pixel(const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t source_x, size_t source_y);
static void AppAI_ReadRgbFromYuv422Pixel(const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t source_x, size_t source_y,
		float *r_out, float *g_out, float *b_out);
static void AppAI_SetForcedCrop(const char *label, size_t x_min,
		size_t y_min, size_t width, size_t height);
static void AppAI_ClearForcedCrop(void);
static bool AppAI_DecodeRectifierCropBox(
		const LL_Buffer_InfoTypeDef *output_buffer_info,
		AppAI_SourceCrop *crop_out,
		AppAI_RectifierBox *rectifier_box_out);
int mcu_cache_clean_range(uint32_t start_addr, uint32_t end_addr) {
	return AppAI_ApplyCacheRange(start_addr, end_addr, true, false);
}

int mcu_cache_invalidate_range(uint32_t start_addr, uint32_t end_addr) {
	return AppAI_ApplyCacheRange(start_addr, end_addr, false, true);
}

static bool AppAI_EnsureNpuHardwareReady(void) {
	if (app_ai_npu_hw_initialized) {
		return true;
	}

	(void) DebugConsole_WriteString("[AI] NPU hardware bring-up start.\r\n");
	__HAL_RCC_NPU_CLK_ENABLE();
	__HAL_RCC_NPU_FORCE_RESET();
	__HAL_RCC_NPU_RELEASE_RESET();
	__HAL_RCC_NPU_CLK_SLEEP_DISABLE();

