rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	__HAL_RCC_CACHEAXI_CLK_ENABLE();
	__HAL_RCC_CACHEAXI_FORCE_RESET();
	__HAL_RCC_CACHEAXI_RELEASE_RESET();
	__HAL_RCC_CACHEAXI_CLK_SLEEP_DISABLE();

	AppAI_EnableNpuMemoryAndCaches();

	npu_cache_init();
	npu_cache_enable();

	AppAI_ConfigureNpuAccessControl();
	AppAI_ConfigureNpuRisafDefaults();

	app_ai_npu_hw_initialized = true;
	(void) DebugConsole_WriteString("[AI] NPU hardware bring-up OK.\r\n");
	return true;
}

static bool AppAI_EnsureXspi2MemoryReady(void) {
	BSP_XSPI_NOR_Init_t flash = { 0 };
	RCC_PeriphCLKInitTypeDef periph_clk = { 0 };
	int32_t bsp_status = BSP_ERROR_NONE;

	if (app_ai_xspi2_initialized) {
		return true;
	}

	(void) DebugConsole_WriteString("[AI] XSPI2 memory bring-up start.\r\n");
	/* If a prior verify attempt left the flash in memory-mapped mode, erase and
	 * write commands will fail.  Take it back to indirect mode first. DeInit
	 * handles this cleanly regardless of the current BSP context state. */
	(void) BSP_XSPI_NOR_DeInit(0U);

	periph_clk.PeriphClockSelection = RCC_PERIPHCLK_XSPI2;
	periph_clk.Xspi2ClockSelection = RCC_XSPI2CLKSOURCE_IC3;
	if (HAL_RCCEx_PeriphCLKConfig(&periph_clk) != HAL_OK) {
		(void) DebugConsole_WriteString("[AI] XSPI2 clock config failed.\r\n");
		return false;
	}

	flash.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
	flash.TransferRate = BSP_XSPI_NOR_STR_TRANSFER;
	bsp_status = BSP_XSPI_NOR_Init(0U, &flash);
	if (bsp_status != BSP_ERROR_NONE) {
		char msg[96];
		(void) snprintf(msg, sizeof(msg),
				"[AI] BSP_XSPI_NOR_Init for provisioning failed: %ld\r\n",
				(long) bsp_status);
		(void) DebugConsole_WriteString(msg);
		return false;
	}

	(void) DebugConsole_WriteString("[AI] XSPI2 memory bring-up OK.\r\n");
	return true;
}

static bool AppAI_ReconfigureXspi2ForRuntime(void) {
	BSP_XSPI_NOR_Init_t flash = { 0 };
	RCC_PeriphCLKInitTypeDef periph_clk = { 0 };
	int32_t bsp_status = BSP_ERROR_NONE;

	/* Drop out of memory-mapped mode before changing the flash transfer rate.
	 * Clear the provisioning-mode guard so EnsureXspi2MemoryReady will
	 * re-initialize the peripheral into indirect/write mode if provisioning
	 * is needed again after this reconfigure. */
	app_ai_xspi2_initialized = false;
	(void) DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure: disable MM start.\r\n");
	(void) BSP_XSPI_NOR_DisableMemoryMappedMode(0U);
	(void) DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure: disable MM OK.\r\n");
	(void) DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure: deinit start.\r\n");
	(void) BSP_XSPI_NOR_DeInit(0U);
	(void) DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure: deinit OK.\r\n");

	periph_clk.PeriphClockSelection = RCC_PERIPHCLK_XSPI2;
	periph_clk.Xspi2ClockSelection = RCC_XSPI2CLKSOURCE_IC3;
	(void) DebugConsole_WriteString(
			"[AI] xSPI2 runtime reconfigure: clock config start.\r\n");
	if (HAL_RCCEx_PeriphCLKConfig(&periph_clk) != HAL_OK) {
		(void) DebugConsole_WriteString(
				"[AI] xSPI2 runtime reconfigure: clock config failed.\r\n");
		return false;
	}
	(void) DebugConsole_WriteString(
			"[AI] xSPI2 runtime reconfigure: clock config OK.\r\n");

	flash.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
	/* Keep the runtime in STR mode for now. The board already initializes and
	 * programs the xSPI2 NOR successfully in STR, while the DTR reconfigure
	 * path was failing during BSP_XSPI_NOR_Init() with -5. We only need the
	 * mapped window to be valid for the stage runtime. */
	flash.TransferRate = BSP_XSPI_NOR_STR_TRANSFER;
	(void) DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure: init start.\r\n");
	bsp_status = BSP_XSPI_NOR_Init(0U, &flash);
	if (bsp_status != BSP_ERROR_NONE) {
		char msg[96];
		(void) snprintf(msg, sizeof(msg),
				"[AI] xSPI2 runtime reconfigure: init failed: %ld\r\n",
				(long) bsp_status);
		(void) DebugConsole_WriteString(msg);
		return false;
	}
	(void) DebugConsole_WriteString("[AI] xSPI2 runtime reconfigure: init OK.\r\n");

	/* Leave the peripheral in indirect mode so callers that need to probe flash
	 * via BSP_XSPI_NOR_Read can do so immediately.  Callers that need the
	 * memory-mapped window must call BSP_XSPI_NOR_EnableMemoryMappedMode()
	 * themselves after this function returns. */
	return true;
}

static bool AppAI_Xspi2EnableMemoryMappedMode(void) {
	(void) DebugConsole_WriteString("[AI] xSPI2 enable MM start.\r\n");
	if (BSP_XSPI_NOR_EnableMemoryMappedMode(0U) != BSP_ERROR_NONE) {
		(void) DebugConsole_WriteString("[AI] xSPI2 enable MM failed.\r\n");
		return false;
	}
	(void) DebugConsole_WriteString("[AI] xSPI2 enable MM OK.\r\n");
	return true;
}

static bool AppAI_Xspi2ReadFlashProbe(const uint32_t chip_base_offset,
		const uint32_t flash_offset,
		const uint8_t *expected_bytes, const size_t expected_length) {
	uint8_t flash_bytes[APP_AI_XSPI2_PROBE_BYTES] = { 0U };

	if ((expected_bytes == NULL) || (expected_length == 0U)
			|| (expected_length > APP_AI_XSPI2_PROBE_BYTES)) {
		return false;
	}

	if (BSP_XSPI_NOR_Read(0U, flash_bytes,
			chip_base_offset + flash_offset,
			(uint32_t) expected_length) != BSP_ERROR_NONE) {
		return false;
	}

	return (memcmp(flash_bytes, expected_bytes, expected_length) == 0);
}

static bool AppAI_Xspi2ReadMappedProbe(const uint32_t flash_offset,
		const uint8_t *expected_bytes, const size_t expected_length) {
	const uint8_t *const flash_ptr = (const uint8_t *) (APP_AI_XSPI2_MODEL_BASE_ADDR
			+ flash_offset);

	if ((expected_bytes == NULL) || (expected_length == 0U)
			|| (expected_length > APP_AI_XSPI2_PROBE_BYTES)) {
		return false;
	}

	(void) mcu_cache_invalidate_range((uint32_t) flash_ptr,
			(uint32_t) flash_ptr + (uint32_t) expected_length);

	return (memcmp(flash_ptr, expected_bytes, expected_length) == 0);
}

static void AppAI_LogXspi2PrefixBytes(const char *label,
		const uint8_t *bytes) {
	if ((label == NULL) || (bytes == NULL)) {
		return;
	}

	DebugConsole_Printf(
			"[AI] %s %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X\r\n",
			label, bytes[0], bytes[1], bytes[2], bytes[3], bytes[4], bytes[5],
			bytes[6], bytes[7], bytes[8], bytes[9], bytes[10], bytes[11],
			bytes[12], bytes[13], bytes[14], bytes[15]);
}

/**
 * @brief Print a compact signature for the captured input frame.
 *
 * This makes it easy to compare whether two runs actually fed different
 * camera data into the model.
 */
static void AppAI_LogFrameSignature(const uint8_t *frame_bytes,
		size_t frame_size) {
	uint8_t first_bytes[8U] = { 0U };
	uint32_t hash = 2166136261UL;
	size_t preview_count = 0U;

	if ((frame_bytes == NULL) || (frame_size == 0U)) {
		DebugConsole_Printf("[AI] Frame signature skipped: empty frame.\r\n");
		return;
	}

	preview_count = (frame_size < sizeof(first_bytes)) ? frame_size
			: sizeof(first_bytes);
	for (size_t index = 0U; index < preview_count; index++) {
		first_bytes[index] = frame_bytes[index];
	}

