rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	for (size_t index = 0U; index < frame_size; index++) {
		hash ^= frame_bytes[index];
		hash *= 16777619UL;
	}

	DebugConsole_Printf(
			"[AI] Frame signature: len=%lu hash=0x%08lX first8=[%02X %02X %02X %02X %02X %02X %02X %02X]\r\n",
			(unsigned long) frame_size, (unsigned long) hash,
			(unsigned int) first_bytes[0], (unsigned int) first_bytes[1],
			(unsigned int) first_bytes[2], (unsigned int) first_bytes[3],
			(unsigned int) first_bytes[4], (unsigned int) first_bytes[5],
			(unsigned int) first_bytes[6], (unsigned int) first_bytes[7]);
}

/**
 * @brief Print a compact signature for the preprocessed model input tensor.
 *
 * This tells us whether the captured scene is still distinct after the
 * YUV422-to-RGB preprocessing and dial ROI crop.
 */
static void AppAI_LogInputSignature(const float *input_buffer,
		size_t input_float_count) {
	const uint8_t *bytes = NULL;
	uint8_t first_bytes[8U] = { 0U };
	uint32_t first_words[4U] = { 0U };
	uint32_t hash = 2166136261UL;
	size_t byte_count = 0U;
	size_t preview_bytes = 0U;
	size_t preview_words = 0U;

	if ((input_buffer == NULL) || (input_float_count == 0U)) {
		DebugConsole_Printf("[AI] Input signature skipped: empty tensor.\r\n");
		return;
	}

	bytes = (const uint8_t *) input_buffer;
	byte_count = input_float_count * sizeof(float);
	preview_bytes = (byte_count < sizeof(first_bytes)) ? byte_count
			: sizeof(first_bytes);
	preview_words = (input_float_count < 4U) ? input_float_count : 4U;

	for (size_t index = 0U; index < preview_bytes; index++) {
		first_bytes[index] = bytes[index];
	}

	for (size_t index = 0U; index < preview_words; index++) {
		(void) memcpy(&first_words[index], &input_buffer[index],
				sizeof(uint32_t));
	}

	for (size_t index = 0U; index < byte_count; index++) {
		hash ^= bytes[index];
		hash *= 16777619UL;
	}

	DebugConsole_Printf(
			"[AI] Input signature: floats=%lu hash=0x%08lX first8=[%02X %02X %02X %02X %02X %02X %02X %02X] first4=[0x%08lX,0x%08lX,0x%08lX,0x%08lX]\r\n",
			(unsigned long) input_float_count, (unsigned long) hash,
			(unsigned int) first_bytes[0], (unsigned int) first_bytes[1],
			(unsigned int) first_bytes[2], (unsigned int) first_bytes[3],
			(unsigned int) first_bytes[4], (unsigned int) first_bytes[5],
			(unsigned int) first_bytes[6], (unsigned int) first_bytes[7],
			(unsigned long) first_words[0], (unsigned long) first_words[1],
			(unsigned long) first_words[2], (unsigned long) first_words[3]);
}

/**
 * @brief Print a small diagnostic window from the center of the input tensor.
 *
 * The top-left bytes can be padding or background, so this summary looks at the
 * tensor region where the dial should live after cropping and resizing.
 */
static void AppAI_LogInputTensorWindow(const float *input_buffer,
		size_t input_float_count) {
	const size_t tensor_width = (size_t) APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t tensor_height = (size_t) APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	const size_t center_x = tensor_width / 2U;
	const size_t center_y = tensor_height / 2U;
	const size_t window_radius = 8U;
	const size_t x_min = (center_x > window_radius) ? (center_x - window_radius)
			: 0U;
	const size_t y_min = (center_y > window_radius) ? (center_y - window_radius)
			: 0U;
	const size_t x_max = ((center_x + window_radius) < tensor_width) ?
			(center_x + window_radius) : tensor_width;
	const size_t y_max = ((center_y + window_radius) < tensor_height) ?
			(center_y + window_radius) : tensor_height;
	float sum_r = 0.0f;
	float sum_g = 0.0f;
	float sum_b = 0.0f;
	float min_r = 1.0f;
	float min_g = 1.0f;
	float min_b = 1.0f;
	float max_r = 0.0f;
	float max_g = 0.0f;
	float max_b = 0.0f;
	float center_r = 0.0f;
	float center_g = 0.0f;
	float center_b = 0.0f;
	unsigned long center_r_milli = 0U;
	unsigned long center_g_milli = 0U;
	unsigned long center_b_milli = 0U;
	unsigned long mean_r_milli = 0U;
	unsigned long mean_g_milli = 0U;
	unsigned long mean_b_milli = 0U;
	unsigned long min_r_milli = 0U;
	unsigned long min_g_milli = 0U;
	unsigned long min_b_milli = 0U;
	unsigned long max_r_milli = 0U;
	unsigned long max_g_milli = 0U;
	unsigned long max_b_milli = 0U;
	size_t sample_count = 0U;

	if ((input_buffer == NULL) || (input_float_count < APP_AI_MODEL_INPUT_FLOAT_COUNT)) {
		return;
	}

	for (size_t y = y_min; y < y_max; y++) {
		for (size_t x = x_min; x < x_max; x++) {
			const size_t pixel_index = (y * tensor_width) + x;
			const size_t base = pixel_index * 3U;
			const float r = input_buffer[base + 0U];
			const float g = input_buffer[base + 1U];
			const float b = input_buffer[base + 2U];

			if (r < min_r) {
				min_r = r;
			}
			if (g < min_g) {
				min_g = g;
			}
			if (b < min_b) {
				min_b = b;
			}
			if (r > max_r) {
				max_r = r;
			}
			if (g > max_g) {
				max_g = g;
			}
			if (b > max_b) {
				max_b = b;
			}

			sum_r += r;
			sum_g += g;
			sum_b += b;
			sample_count++;
		}
	}

	{
		const size_t center_base = ((center_y * tensor_width) + center_x) * 3U;
		center_r = input_buffer[center_base + 0U];
		center_g = input_buffer[center_base + 1U];
		center_b = input_buffer[center_base + 2U];
	}

	if (sample_count == 0U) {
		return;
	}

	center_r_milli = (unsigned long) ((center_r * 1000.0f) + 0.5f);
	center_g_milli = (unsigned long) ((center_g * 1000.0f) + 0.5f);
	center_b_milli = (unsigned long) ((center_b * 1000.0f) + 0.5f);
	mean_r_milli = (unsigned long) ((sum_r / (float) sample_count) * 1000.0f
			+ 0.5f);
	mean_g_milli = (unsigned long) ((sum_g / (float) sample_count) * 1000.0f
			+ 0.5f);
	mean_b_milli = (unsigned long) ((sum_b / (float) sample_count) * 1000.0f
			+ 0.5f);
	min_r_milli = (unsigned long) (min_r * 1000.0f + 0.5f);
	min_g_milli = (unsigned long) (min_g * 1000.0f + 0.5f);
	min_b_milli = (unsigned long) (min_b * 1000.0f + 0.5f);
	max_r_milli = (unsigned long) (max_r * 1000.0f + 0.5f);
	max_g_milli = (unsigned long) (max_g * 1000.0f + 0.5f);
	max_b_milli = (unsigned long) (max_b * 1000.0f + 0.5f);

	DebugConsole_Printf(
			"[AI] Tensor center window: x=[%lu,%lu) y=[%lu,%lu) center_milli=[%lu %lu %lu] mean_milli=[%lu %lu %lu] min_milli=[%lu %lu %lu] max_milli=[%lu %lu %lu]\r\n",
			(unsigned long) x_min, (unsigned long) x_max, (unsigned long) y_min,
			(unsigned long) y_max, center_r_milli, center_g_milli,
			center_b_milli, mean_r_milli, mean_g_milli, mean_b_milli,
			min_r_milli, min_g_milli, min_b_milli, max_r_milli, max_g_milli,
			max_b_milli);

	AppAI_LogTensorRowSamples("top", input_buffer, tensor_width,
			y_min + ((y_max - y_min) / 4U), x_min, x_max);
	AppAI_LogTensorRowSamples("mid", input_buffer, tensor_width, center_y,
			x_min, x_max);
	AppAI_LogTensorRowSamples("bottom", input_buffer, tensor_width,
			y_min + (((y_max - y_min) * 3U) / 4U), x_min, x_max);
}

/**
 * @brief Print a compact fingerprint for the tensor that actually reaches the NPU.
 *
 * The disabled verbose tensor logs are useful in source, but this helper uses
 * direct console writes so we can see a stable per-frame summary on hardware.
 */
static void AppAI_LogInputProbeSummary(const float *input_buffer,
		size_t input_float_count) {
	const size_t tensor_width = (size_t) APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t tensor_height = (size_t) APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	const size_t sample_points[4U][2U] = {
		{ tensor_width / 2U, tensor_height / 2U },
		{ tensor_width / 2U, tensor_height / 4U },
		{ tensor_width / 4U, tensor_height / 2U },
		{ (tensor_width * 3U) / 4U, tensor_height / 2U },
	};
	const char *sample_labels[4U] = {
		"center",
		"top-mid",
		"left-mid",
		"right-mid",
	};
	const uint8_t *bytes = NULL;
	uint8_t first_bytes[8U] = { 0U };
	uint32_t hash = 2166136261UL;
	uint32_t first_words[4U] = { 0U };
	float sum_value = 0.0f;
	float min_value = 1.0f;
	float max_value = 0.0f;
	size_t active_count = 0U;
	size_t byte_count = 0U;
	size_t preview_bytes = 0U;
	size_t preview_words = 0U;

	if ((input_buffer == NULL)
			|| (input_float_count < APP_AI_MODEL_INPUT_FLOAT_COUNT)) {
		(void) DebugConsole_WriteString("[AI] Input probe skipped.\r\n");
		return;
	}

	bytes = (const uint8_t *) input_buffer;
	byte_count = input_float_count * sizeof(float);
	preview_bytes = (byte_count < sizeof(first_bytes)) ? byte_count
			: sizeof(first_bytes);
	preview_words = (input_float_count < 4U) ? input_float_count : 4U;

	for (size_t index = 0U; index < preview_bytes; index++) {
		first_bytes[index] = bytes[index];
	}

