rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	for (size_t index = 0U; index < preview_words; index++) {
		(void) memcpy(&first_words[index], &input_buffer[index],
				sizeof(uint32_t));
	}

	for (size_t index = 0U; index < byte_count; index++) {
		hash ^= bytes[index];
		hash *= 16777619UL;
	}

	for (size_t index = 0U; index < input_float_count; index++) {
		const float value = input_buffer[index];

		sum_value += value;
		if (value < min_value) {
			min_value = value;
		}
		if (value > max_value) {
			max_value = value;
		}
		if ((value > 0.001f) || (value < -0.001f)) {
			active_count++;
		}
	}

	{
		char line[224];
		(void) snprintf(line, sizeof(line),
				"[AI] Input probe: floats=%lu bytes=%lu hash=0x%08lX first8=[%02X %02X %02X %02X %02X %02X %02X %02X] first4=[0x%08lX 0x%08lX 0x%08lX 0x%08lX]\r\n",
				(unsigned long) input_float_count,
				(unsigned long) byte_count, (unsigned long) hash,
				(unsigned int) first_bytes[0], (unsigned int) first_bytes[1],
				(unsigned int) first_bytes[2], (unsigned int) first_bytes[3],
				(unsigned int) first_bytes[4], (unsigned int) first_bytes[5],
				(unsigned int) first_bytes[6], (unsigned int) first_bytes[7],
				(unsigned long) first_words[0], (unsigned long) first_words[1],
				(unsigned long) first_words[2], (unsigned long) first_words[3]);
		(void) DebugConsole_WriteString(line);
	}

	{
		const unsigned long mean_milli =
				(unsigned long) (((sum_value / (float) input_float_count) * 1000.0f)
						+ 0.5f);
		const unsigned long min_milli =
				(unsigned long) ((min_value * 1000.0f) + 0.5f);
		const unsigned long max_milli =
				(unsigned long) ((max_value * 1000.0f) + 0.5f);
		char line[192];

		(void) snprintf(line, sizeof(line),
				"[AI] Input probe stats: active=%lu/%lu mean_milli=%lu min_milli=%lu max_milli=%lu\r\n",
				(unsigned long) active_count, (unsigned long) input_float_count,
				mean_milli, min_milli, max_milli);
		(void) DebugConsole_WriteString(line);
	}

	for (size_t index = 0U; index < 4U; index++) {
		const size_t sample_x = sample_points[index][0U];
		const size_t sample_y = sample_points[index][1U];
		const size_t pixel_index = (sample_y * tensor_width) + sample_x;
		const size_t base = pixel_index * 3U;
		const uint32_t r_bits = 0U;
		const uint32_t g_bits = 0U;
		const uint32_t b_bits = 0U;
		const unsigned long r_milli =
				(unsigned long) ((input_buffer[base + 0U] * 1000.0f) + 0.5f);
		const unsigned long g_milli =
				(unsigned long) ((input_buffer[base + 1U] * 1000.0f) + 0.5f);
		const unsigned long b_milli =
				(unsigned long) ((input_buffer[base + 2U] * 1000.0f) + 0.5f);
		uint32_t sample_bits[3U] = { 0U, 0U, 0U };
		char line[160];

		(void) memcpy(&sample_bits[0U], &input_buffer[base + 0U],
				sizeof(uint32_t));
		(void) memcpy(&sample_bits[1U], &input_buffer[base + 1U],
				sizeof(uint32_t));
		(void) memcpy(&sample_bits[2U], &input_buffer[base + 2U],
				sizeof(uint32_t));

		(void) r_bits;
		(void) g_bits;
		(void) b_bits;

		(void) snprintf(line, sizeof(line),
				"[AI] Input probe %s: x=%lu y=%lu rgb_milli=[%lu %lu %lu] rgb_bits=[0x%08lX 0x%08lX 0x%08lX]\r\n",
				sample_labels[index], (unsigned long) sample_x,
				(unsigned long) sample_y, r_milli, g_milli, b_milli,
				(unsigned long) sample_bits[0U],
				(unsigned long) sample_bits[1U],
				(unsigned long) sample_bits[2U]);
		(void) DebugConsole_WriteString(line);
	}
}

/**
 * @brief Print a few evenly spaced samples from one tensor row.
 *
 * This makes it easier to see whether the row contains dial markings, the
 * needle, or only flat background after the crop/resample step.
 */
static void AppAI_LogTensorRowSamples(const char *label,
		const float *input_buffer, size_t tensor_width, size_t row_y,
		size_t x_min, size_t x_max) {
	const size_t sample_count = 5U;
	size_t positions[5U] = { 0U };

	if ((label == NULL) || (input_buffer == NULL) || (tensor_width == 0U)
			|| (x_max <= x_min)) {
		return;
	}

	{
		const size_t span = (x_max > x_min) ? (x_max - x_min - 1U) : 0U;
		positions[0U] = x_min;
		positions[1U] = x_min + (span / 4U);
		positions[2U] = x_min + (span / 2U);
		positions[3U] = x_min + ((span * 3U) / 4U);
		positions[4U] = (x_max > 0U) ? (x_max - 1U) : 0U;
	}

	DebugConsole_Printf("[AI] Row %s y=%lu:",
			label, (unsigned long) row_y);
	for (size_t index = 0U; index < sample_count; index++) {
		const size_t pixel_index = (row_y * tensor_width) + positions[index];
		const size_t base = pixel_index * 3U;
		const unsigned long r_milli =
				(unsigned long) (input_buffer[base + 0U] * 1000.0f + 0.5f);
		const unsigned long g_milli =
				(unsigned long) (input_buffer[base + 1U] * 1000.0f + 0.5f);
		const unsigned long b_milli =
				(unsigned long) (input_buffer[base + 2U] * 1000.0f + 0.5f);

		DebugConsole_Printf(" x=%lu rgb=[%lu %lu %lu]",
				(unsigned long) positions[index], r_milli, g_milli, b_milli);
	}
	DebugConsole_Printf("\r\n");
}

/**
 * @brief Print a compact luma patch from the source YUV422 frame.
 */
static void AppAI_LogSourcePatch(const char *label, const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t center_x, size_t center_y,
		size_t radius_pixels) {
	const size_t x_min = (center_x > radius_pixels) ? (center_x - radius_pixels)
			: 0U;
	const size_t y_min = (center_y > radius_pixels) ? (center_y - radius_pixels)
			: 0U;
	const size_t x_max = ((center_x + radius_pixels)
			< APP_AI_CAPTURE_FRAME_WIDTH_PIXELS) ? (center_x + radius_pixels)
			: (APP_AI_CAPTURE_FRAME_WIDTH_PIXELS - 1U);
	const size_t y_max = ((center_y + radius_pixels)
			< APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS) ? (center_y + radius_pixels)
			: (APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS - 1U);

	if ((label == NULL) || (frame_bytes == NULL) || (frame_width_pixels == 0U)) {
		return;
	}

	DebugConsole_Printf(
			"[AI] %s source patch center=(%lu,%lu) x=[%lu,%lu] y=[%lu,%lu]\r\n",
			label, (unsigned long) center_x, (unsigned long) center_y,
			(unsigned long) x_min, (unsigned long) x_max,
			(unsigned long) y_min, (unsigned long) y_max);

	for (size_t y = y_min; y <= y_max; ++y) {
		DebugConsole_Printf("[AI] %s y=%lu:", label, (unsigned long) y);
		for (size_t x = x_min; x <= x_max; ++x) {
			const uint8_t luma = AppAI_ReadYuv422Luma(frame_bytes,
					frame_width_pixels, x, y);
			const unsigned long luma_milli =
					(unsigned long) ((luma * 1000U) / 255U);

