rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
			DebugConsole_Printf(" x=%lu=%lu", (unsigned long) x, luma_milli);
		}
		DebugConsole_Printf("\r\n");
	}
}

/**
 * @brief Print a compact tensor patch from the preprocessed input buffer.
 */
static void AppAI_LogTensorPatch(const char *label, const float *input_buffer,
		size_t tensor_width, size_t center_x, size_t center_y,
		size_t radius_pixels) {
	const size_t x_min = (center_x > radius_pixels) ? (center_x - radius_pixels)
			: 0U;
	const size_t y_min = (center_y > radius_pixels) ? (center_y - radius_pixels)
			: 0U;
	const size_t x_max = ((center_x + radius_pixels) < tensor_width) ?
			(center_x + radius_pixels) : (tensor_width - 1U);
	const size_t y_max = ((center_y + radius_pixels)
			< APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS) ? (center_y + radius_pixels)
			: (APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS - 1U);

	if ((label == NULL) || (input_buffer == NULL) || (tensor_width == 0U)) {
		return;
	}

	DebugConsole_Printf(
			"[AI] %s tensor patch center=(%lu,%lu) x=[%lu,%lu] y=[%lu,%lu]\r\n",
			label, (unsigned long) center_x, (unsigned long) center_y,
			(unsigned long) x_min, (unsigned long) x_max,
			(unsigned long) y_min, (unsigned long) y_max);

	for (size_t y = y_min; y <= y_max; ++y) {
		DebugConsole_Printf("[AI] %s y=%lu:", label, (unsigned long) y);
		for (size_t x = x_min; x <= x_max; ++x) {
			const size_t pixel_index = (y * tensor_width) + x;
			const size_t base = pixel_index * 3U;
			const unsigned long r_milli =
					(unsigned long) (input_buffer[base + 0U] * 1000.0f + 0.5f);
			const unsigned long g_milli =
					(unsigned long) (input_buffer[base + 1U] * 1000.0f + 0.5f);
			const unsigned long b_milli =
					(unsigned long) (input_buffer[base + 2U] * 1000.0f + 0.5f);

			DebugConsole_Printf(" x=%lu=[%lu %lu %lu]",
					(unsigned long) x, r_milli, g_milli, b_milli);
		}
		DebugConsole_Printf("\r\n");
	}
}

/**
 * @brief Print the source-crop luma that is being fed into resize/pad.
 *
 * This is the lowest-level image diagnostic in the pipeline. If these values
 * are already near zero, the problem is before tensor fill. If they are healthy
 * but the tensor is still zero, then the resize/write path is wrong.
 */
static void AppAI_LogSourceCropWindow(const uint8_t *frame_bytes,
		size_t frame_size, size_t frame_width_pixels, size_t frame_height_pixels,
		size_t crop_x_min, size_t crop_y_min, size_t crop_width,
		size_t crop_height) {
	const size_t center_x = crop_x_min + (crop_width / 2U);
	const size_t center_y = crop_y_min + (crop_height / 2U);
	const size_t window_radius = 8U;
	const size_t x_min = (center_x > window_radius) ? (center_x - window_radius)
			: crop_x_min;
	const size_t y_min = (center_y > window_radius) ? (center_y - window_radius)
			: crop_y_min;
	const size_t x_max = ((center_x + window_radius) < (crop_x_min + crop_width)) ?
			(center_x + window_radius) : (crop_x_min + crop_width);
	const size_t y_max = ((center_y + window_radius) < (crop_y_min + crop_height)) ?
			(center_y + window_radius) : (crop_y_min + crop_height);
	uint64_t sum_luma = 0U;
	uint8_t min_luma = 0xFFU;
	uint8_t max_luma = 0U;
	uint8_t center_luma = 0U;
	unsigned long center_luma_milli = 0U;
	unsigned long mean_luma_milli = 0U;
	unsigned long min_luma_milli = 0U;
	unsigned long max_luma_milli = 0U;
	size_t sample_count = 0U;

	if ((frame_bytes == NULL) || (frame_size < (frame_width_pixels
			* frame_height_pixels * 2U))) {
		return;
	}

	for (size_t y = y_min; y < y_max; ++y) {
		for (size_t x = x_min; x < x_max; ++x) {
			const uint8_t luma = AppAI_ReadYuv422Luma(frame_bytes,
					frame_width_pixels, x, y);

			if (luma < min_luma) {
				min_luma = luma;
			}
			if (luma > max_luma) {
				max_luma = luma;
			}
			sum_luma += (uint64_t) luma;
			sample_count++;
		}
	}

	center_luma = AppAI_ReadYuv422Luma(frame_bytes, frame_width_pixels,
			center_x, center_y);

	if (sample_count == 0U) {
		return;
	}

	center_luma_milli = (unsigned long) ((center_luma * 1000U) / 255U);
	mean_luma_milli = (unsigned long) (((sum_luma / sample_count) * 1000U)
			/ 255U);
	min_luma_milli = (unsigned long) ((min_luma * 1000U) / 255U);
	max_luma_milli = (unsigned long) ((max_luma * 1000U) / 255U);

	DebugConsole_Printf(
			"[AI] Source crop window: x=[%lu,%lu) y=[%lu,%lu) center_luma_milli=[%lu] mean_luma_milli=[%lu] min_luma_milli=[%lu] max_luma_milli=[%lu]\r\n",
			(unsigned long) x_min, (unsigned long) x_max, (unsigned long) y_min,
			(unsigned long) y_max, center_luma_milli, mean_luma_milli,
			min_luma_milli, max_luma_milli);

	AppAI_LogSourcePatch("Source crop center", frame_bytes, frame_width_pixels,
			center_x, center_y, 2U);

	for (size_t index = 0U; index < 3U; ++index) {
		const char *label = (index == 0U) ? "src_top"
				: (index == 1U) ? "src_mid" : "src_bottom";
		const size_t row_y = (index == 0U) ? (y_min + ((y_max - y_min) / 4U))
				: (index == 1U) ? center_y
				: (y_min + (((y_max - y_min) * 3U) / 4U));
		const size_t sample_span = (x_max > x_min) ? (x_max - x_min - 1U) : 0U;
		const size_t sample_x0 = x_min;
		const size_t sample_x1 = x_min + (sample_span / 4U);
		const size_t sample_x2 = x_min + (sample_span / 2U);
		const size_t sample_x3 = x_min + ((sample_span * 3U) / 4U);
		const size_t sample_x4 = (x_max > 0U) ? (x_max - 1U) : 0U;
		const size_t sample_xs[5U] = {
			sample_x0, sample_x1, sample_x2, sample_x3, sample_x4
		};

		DebugConsole_Printf("[AI] %s y=%lu:", label, (unsigned long) row_y);
		for (size_t sample_index = 0U; sample_index < 5U; ++sample_index) {
			const uint8_t luma = AppAI_ReadYuv422Luma(frame_bytes,
					frame_width_pixels, sample_xs[sample_index], row_y);
			const unsigned long luma_milli =
					(unsigned long) ((luma * 1000U) / 255U);

			DebugConsole_Printf(" x=%lu y=%lu",
					(unsigned long) sample_xs[sample_index], luma_milli);
		}
		DebugConsole_Printf("\r\n");
	}
}

/**
 * @brief Print a compact signature for an int8 tensor or activation buffer.
 *
 * This is useful for the model boundary because it tells us whether the
 * quantized activations are changing even when the final dequantized output is
 * still neutral.
 */
static void AppAI_LogInt8BufferSignature(const char *label,
		const int8_t *buffer_ptr, size_t buffer_len_bytes) {
	uint8_t first_bytes[16U] = { 0U };
	int8_t min_value = 127;
	int8_t max_value = -128;
	uint32_t nonzero_count = 0U;
	uint32_t hash = 2166136261UL;
	size_t preview_count = 0U;

	if ((label == NULL) || (buffer_ptr == NULL) || (buffer_len_bytes == 0U)) {
		DebugConsole_Printf(
				"[AI] %s int8 signature skipped: empty buffer.\r\n",
				(label != NULL) ? label : "(unnamed)");
		return;
	}

	preview_count = (buffer_len_bytes < sizeof(first_bytes)) ? buffer_len_bytes
			: sizeof(first_bytes);

	for (size_t index = 0U; index < buffer_len_bytes; ++index) {
		const uint8_t raw_byte = (uint8_t) buffer_ptr[index];

		hash ^= raw_byte;
		hash *= 16777619UL;

