rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
		if (buffer_ptr[index] < min_value) {
			min_value = buffer_ptr[index];
		}
		if (buffer_ptr[index] > max_value) {
			max_value = buffer_ptr[index];
		}
		if (buffer_ptr[index] != 0) {
			nonzero_count++;
		}
		if (index < preview_count) {
			first_bytes[index] = raw_byte;
		}
	}

	DebugConsole_Printf(
			"[AI] %s int8 signature: bytes=%lu hash=0x%08lX nonzero=%lu min=%d max=%d first16=[%02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X]\r\n",
			label, (unsigned long) buffer_len_bytes, (unsigned long) hash,
			(unsigned long) nonzero_count, (int) min_value, (int) max_value,
			(unsigned int) first_bytes[0], (unsigned int) first_bytes[1],
			(unsigned int) first_bytes[2], (unsigned int) first_bytes[3],
			(unsigned int) first_bytes[4], (unsigned int) first_bytes[5],
			(unsigned int) first_bytes[6], (unsigned int) first_bytes[7],
			(unsigned int) first_bytes[8], (unsigned int) first_bytes[9],
			(unsigned int) first_bytes[10], (unsigned int) first_bytes[11],
			(unsigned int) first_bytes[12], (unsigned int) first_bytes[13],
			(unsigned int) first_bytes[14], (unsigned int) first_bytes[15]);
}

/**
 * @brief Print a compact signature for any buffer by raw bytes.
 *
 * This avoids guessing the tensor type when we just want to know whether the
 * runtime wrote anything other than zero into a model activation.
 */
static void AppAI_LogRawBufferSignature(const char *label,
		const uint8_t *buffer_ptr, size_t buffer_len_bytes) {
	uint8_t first_bytes[16U] = { 0U };
	uint8_t min_value = 255U;
	uint8_t max_value = 0U;
	uint32_t nonzero_count = 0U;
	uint32_t hash = 2166136261UL;
	size_t preview_count = 0U;

	if ((label == NULL) || (buffer_ptr == NULL) || (buffer_len_bytes == 0U)) {
		DebugConsole_Printf(
				"[AI] %s raw signature skipped: empty buffer.\r\n",
				(label != NULL) ? label : "(unnamed)");
		return;
	}

	preview_count = (buffer_len_bytes < sizeof(first_bytes)) ? buffer_len_bytes
			: sizeof(first_bytes);

	for (size_t index = 0U; index < buffer_len_bytes; ++index) {
		const uint8_t value = buffer_ptr[index];

		hash ^= value;
		hash *= 16777619UL;

		if (value < min_value) {
			min_value = value;
		}
		if (value > max_value) {
			max_value = value;
		}
		if (value != 0U) {
			nonzero_count++;
		}
		if (index < preview_count) {
			first_bytes[index] = value;
		}
	}

	DebugConsole_Printf(
			"[AI] %s raw signature: bytes=%lu hash=0x%08lX nonzero=%lu min=%u max=%u first16=[%02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X]\r\n",
			label, (unsigned long) buffer_len_bytes, (unsigned long) hash,
			(unsigned long) nonzero_count, (unsigned int) min_value,
			(unsigned int) max_value, (unsigned int) first_bytes[0],
			(unsigned int) first_bytes[1], (unsigned int) first_bytes[2],
			(unsigned int) first_bytes[3], (unsigned int) first_bytes[4],
			(unsigned int) first_bytes[5], (unsigned int) first_bytes[6],
			(unsigned int) first_bytes[7], (unsigned int) first_bytes[8],
			(unsigned int) first_bytes[9], (unsigned int) first_bytes[10],
			(unsigned int) first_bytes[11], (unsigned int) first_bytes[12],
			(unsigned int) first_bytes[13], (unsigned int) first_bytes[14],
			(unsigned int) first_bytes[15]);
}

static const char *AppAI_BufferTypeName(const LL_Buffer_InfoTypeDef *buffer_info) {
	if (buffer_info == NULL) {
		return "(null)";
	}

	switch (buffer_info->type) {
	case DataType_FLOAT:
		return "FLOAT";
	case DataType_INT8:
		return "INT8";
	case DataType_UINT8:
		return "UINT8";
	case DataType_INT16:
		return "INT16";
	default:
		return "OTHER";
	}
}

static void AppAI_LogBufferInfoAndSignature(const char *label,
		const LL_Buffer_InfoTypeDef *buffer_info) {
	const void *buffer_addr = NULL;
	size_t buffer_len = 0U;
	float scale_value = 0.0f;
	int16_t offset_value = 0;
	const void *scale_addr = NULL;
	const void *offset_addr = NULL;

	if ((label == NULL) || (buffer_info == NULL)) {
		DebugConsole_Printf("[AI] %s buffer info unavailable.\r\n",
				(label != NULL) ? label : "(unnamed)");
		return;
	}

	buffer_addr = LL_Buffer_addr_start(buffer_info);
	buffer_len = (size_t) LL_Buffer_len(buffer_info);
	scale_addr = buffer_info->scale;
	offset_addr = buffer_info->offset;

	DebugConsole_Printf(
			"[AI] %s info: name=%s addr=%p len=%lu type=%s nbits=%u ndims=%u Qm=%u Qn=%u Qunsigned=%u epoch=%u batch=%u shape=[%lu,%lu,%lu,%lu]\r\n",
			label,
			(buffer_info->name != NULL) ? buffer_info->name : "(unnamed)",
			buffer_addr, (unsigned long) buffer_len,
			AppAI_BufferTypeName(buffer_info), (unsigned int) buffer_info->nbits,
			(unsigned int) buffer_info->ndims, (unsigned int) buffer_info->Qm,
			(unsigned int) buffer_info->Qn, (unsigned int) buffer_info->Qunsigned,
			(unsigned int) buffer_info->epoch, (unsigned int) buffer_info->batch,
			(unsigned long) ((buffer_info->shape != NULL) && (buffer_info->ndims > 0U) ? buffer_info->shape[0] : 0U),
			(unsigned long) ((buffer_info->shape != NULL) && (buffer_info->ndims > 1U) ? buffer_info->shape[1] : 0U),
			(unsigned long) ((buffer_info->shape != NULL) && (buffer_info->ndims > 2U) ? buffer_info->shape[2] : 0U),
			(unsigned long) ((buffer_info->shape != NULL) && (buffer_info->ndims > 3U) ? buffer_info->shape[3] : 0U));

	if ((scale_addr != NULL) && (offset_addr != NULL)) {
		(void) memcpy(&scale_value, scale_addr, sizeof(scale_value));
		offset_value = *(const int16_t *) offset_addr;

		DebugConsole_Printf("[AI] %s qparams: ", label);
		AppAI_LogFloatApprox("scale=", scale_value);
		DebugConsole_Printf(" offset=%d\r\n", (int) offset_value);
	}

	if (buffer_addr != NULL) {
		AppAI_LogRawBufferSignature(label, (const uint8_t *) buffer_addr,
				buffer_len);
	}
}

/**
 * @brief Estimate a gauge crop from bright pixels in the Y channel.
 *
 * The dial face is usually the brightest contiguous object in these captures,
 * so a simple luma threshold is enough to steer the crop toward the useful
 * region before we resize to the model input tensor.
 */
static bool AppAI_EstimateGaugeCropBoxFromYuv422(const uint8_t *frame_bytes,
		size_t frame_size, size_t frame_width_pixels, size_t frame_height_pixels,
		size_t *crop_x_min, size_t *crop_y_min, size_t *crop_width,
		size_t *crop_height) {
	const size_t frame_stride_bytes = frame_width_pixels * 2U;
	const size_t min_crop_width = frame_width_pixels / 4U;
	const size_t min_crop_height = frame_height_pixels / 4U;
	const size_t training_crop_width = (size_t) (((float) frame_width_pixels
			* (APP_AI_TRAINING_CROP_X_MAX_RATIO
			- APP_AI_TRAINING_CROP_X_MIN_RATIO)) + 0.5f);
	const size_t training_crop_height = (size_t) (((float) frame_height_pixels
			* (APP_AI_TRAINING_CROP_Y_MAX_RATIO
			- APP_AI_TRAINING_CROP_Y_MIN_RATIO)) + 0.5f);
	size_t bright_x_min = frame_width_pixels;
	size_t bright_y_min = frame_height_pixels;
	size_t bright_x_max = 0U;
	size_t bright_y_max = 0U;
	size_t bright_count = 0U;
	uint64_t bright_sum_x = 0U;
	uint64_t bright_sum_y = 0U;
	size_t bbox_width = 0U;
	size_t bbox_height = 0U;
	size_t bright_center_x = 0U;
	size_t bright_center_y = 0U;
	size_t biased_center_x = 0U;
	size_t biased_center_y = 0U;
	size_t left = 0U;
	size_t top = 0U;
	size_t right = 0U;
	size_t bottom = 0U;

	if ((frame_bytes == NULL) || (crop_x_min == NULL) || (crop_y_min == NULL)
			|| (crop_width == NULL) || (crop_height == NULL)) {
		return false;
	}

	if (frame_size < (frame_stride_bytes * frame_height_pixels)) {
		return false;
	}

	for (size_t y = APP_AI_GAUGE_CROP_BORDER_PIXELS;
			y < (frame_height_pixels - APP_AI_GAUGE_CROP_BORDER_PIXELS); ++y) {
		const size_t row_offset = y * frame_stride_bytes;

