rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
		for (size_t x = APP_AI_GAUGE_CROP_BORDER_PIXELS;
				x < (frame_width_pixels - APP_AI_GAUGE_CROP_BORDER_PIXELS); ++x) {
			const size_t pair_offset = row_offset + ((x & ~1U) * 2U);
			const size_t y_offset = pair_offset + (((x & 1U) != 0U) ? 2U : 0U);
			const uint8_t luma = frame_bytes[y_offset];

			if (luma < APP_AI_GAUGE_BRIGHT_THRESHOLD) {
				continue;
			}

			bright_count++;
			bright_sum_x += (uint64_t) x;
			bright_sum_y += (uint64_t) y;

			if (x < bright_x_min) {
				bright_x_min = x;
			}
			if (y < bright_y_min) {
				bright_y_min = y;
			}
			if (x > bright_x_max) {
				bright_x_max = x;
			}
			if (y > bright_y_max) {
				bright_y_max = y;
			}
		}
	}

	if (bright_count == 0U) {
		return false;
	}

	bright_center_x = (size_t) (bright_sum_x / (uint64_t) bright_count);
	bright_center_y = (size_t) (bright_sum_y / (uint64_t) bright_count);
	bbox_width = (bright_x_max - bright_x_min) + 1U;
	bbox_height = (bright_y_max - bright_y_min) + 1U;
	if ((bbox_width == 0U) || (bbox_height == 0U)) {
		return false;
	}

	biased_center_x = (bright_center_x > APP_AI_GAUGE_CROP_CENTER_X_BIAS_PIXELS) ?
			(bright_center_x - APP_AI_GAUGE_CROP_CENTER_X_BIAS_PIXELS) : 0U;
	biased_center_y = (bright_center_y > APP_AI_GAUGE_CROP_CENTER_Y_BIAS_PIXELS) ?
			(bright_center_y - APP_AI_GAUGE_CROP_CENTER_Y_BIAS_PIXELS) : 0U;

	/* Anchor a slightly tighter crop on a left-biased bright centroid instead of
	 * using the full bright bbox, which was pulling in too much background. */
	if (training_crop_width == 0U) {
		return false;
	}
	if (training_crop_height == 0U) {
		return false;
	}

	const size_t target_crop_width = (size_t) ((((float) training_crop_width
			* (float) APP_AI_GAUGE_CROP_WIDTH_SCALE_NUMERATOR)
			/ (float) APP_AI_GAUGE_CROP_WIDTH_SCALE_DENOMINATOR) + 0.5f);
	const size_t target_crop_height = (size_t) ((((float) training_crop_height
			* (float) APP_AI_GAUGE_CROP_HEIGHT_SCALE_NUMERATOR)
			/ (float) APP_AI_GAUGE_CROP_HEIGHT_SCALE_DENOMINATOR) + 0.5f);
	const size_t crop_width_pixels =
			(target_crop_width > 0U) ? target_crop_width : 1U;
	const size_t crop_height_pixels =
			(target_crop_height > 0U) ? target_crop_height : 1U;

	left = (biased_center_x > (crop_width_pixels / 2U)) ?
			(biased_center_x - (crop_width_pixels / 2U)) : 0U;
	top = (biased_center_y > (crop_height_pixels / 2U)) ?
			(biased_center_y - (crop_height_pixels / 2U)) : 0U;
	right = left + crop_width_pixels;
	bottom = top + crop_height_pixels;
	if (right > frame_width_pixels) {
		right = frame_width_pixels;
		left = (right > crop_width_pixels) ? (right - crop_width_pixels)
				: 0U;
	}
	if (bottom > frame_height_pixels) {
		bottom = frame_height_pixels;
		top = (bottom > crop_height_pixels) ? (bottom - crop_height_pixels)
				: 0U;
	}

	if ((right <= left) || (bottom <= top)) {
		return false;
	}

	*crop_x_min = left;
	*crop_y_min = top;
	*crop_width = right - left;
	*crop_height = bottom - top;

	if ((*crop_width < min_crop_width) || (*crop_height < min_crop_height)) {
		return false;
	}

	return true;
}

static bool AppAI_LogXspi2ModelFilePrefix(FX_FILE *model_file_ptr) {
	uint8_t source_bytes[APP_AI_XSPI2_PROBE_BYTES] = { 0U };
	ULONG bytes_read = 0U;
	UINT fx_status = FX_SUCCESS;

	if (model_file_ptr == NULL) {
		return false;
	}

	fx_status = fx_file_read(model_file_ptr, source_bytes,
			APP_AI_XSPI2_PROBE_BYTES, &bytes_read);
	if ((fx_status != FX_SUCCESS)
			|| (bytes_read != APP_AI_XSPI2_PROBE_BYTES)) {
		DebugConsole_Printf(
				"[AI] xSPI2 source prefix read failed (fx=%lu n=%lu).\r\n",
				(unsigned long) fx_status, (unsigned long) bytes_read);
		return false;
	}

	AppAI_LogXspi2PrefixBytes("xSPI2 source prefix:", source_bytes);

	fx_status = fx_file_seek(model_file_ptr, 0U);
	if (fx_status != FX_SUCCESS) {
		DebugConsole_Printf(
				"[AI] xSPI2 source rewind failed (fx=%lu).\r\n",
				(unsigned long) fx_status);
		return false;
	}

	return true;
}

static bool AppAI_Xspi2ModelImageMatchesFlash(void) {
	if (!AppAI_Xspi2ReadFlashProbe(APP_AI_XSPI2_SCALAR_CHIP_OFFSET, 0U,
			app_ai_xspi2_signature_start,
			sizeof(app_ai_xspi2_signature_start))) {
		DebugConsole_Printf("[AI] xSPI2 verify failed at start signature.\r\n");
		return false;
	}

	if ((app_ai_xspi2_programmed_size >= APP_AI_XSPI2_PROBE_BYTES)
			&& !AppAI_Xspi2ReadFlashProbe(APP_AI_XSPI2_SCALAR_CHIP_OFFSET,
					app_ai_xspi2_programmed_size - APP_AI_XSPI2_PROBE_BYTES,
					app_ai_xspi2_signature_tail,
					sizeof(app_ai_xspi2_signature_tail))) {
		DebugConsole_Printf("[AI] xSPI2 verify failed at tail signature.\r\n");
		return false;
	}

	return true;
}

static bool AppAI_Xspi2ModelImageMatchesMappedFlash(void) {
	if (!AppAI_Xspi2ReadMappedProbe(0U, app_ai_xspi2_signature_start,
			sizeof(app_ai_xspi2_signature_start))) {
		DebugConsole_Printf(
				"[AI] xSPI2 mapped verify failed at start signature.\r\n");
		return false;
	}

	if ((app_ai_xspi2_programmed_size >= APP_AI_XSPI2_PROBE_BYTES)
			&& !AppAI_Xspi2ReadMappedProbe(
					app_ai_xspi2_programmed_size - APP_AI_XSPI2_PROBE_BYTES,
					app_ai_xspi2_signature_tail,
					sizeof(app_ai_xspi2_signature_tail))) {
		DebugConsole_Printf(
				"[AI] xSPI2 mapped verify failed at tail signature.\r\n");
		return false;
	}

	return true;
}

static bool AppAI_Xspi2ModelImageMatchesMappedFlashForStage(
		const AppAI_ModelStageSpec *stage) {
	bool is_rectifier;
	const uint8_t *sig_start;
	const uint8_t *sig_tail;
	bool sig_valid;
	ULONG programmed_size;

	if (stage == NULL) {
		return false;
	}

	is_rectifier = (strcmp(stage->stage_label, "rectifier") == 0);

	if (is_rectifier) {
		/* Prefer the SD-sourced signature cached during the last provisioning.
		 * Fall back to the hardcoded constant only when no provisioning has
		 * happened yet this boot (cache is zeroed at startup). */
		sig_start      = app_ai_rectifier_sig_valid
				? app_ai_rectifier_sig_start
				: app_ai_rectifier_xspi2_signature_start;
		sig_tail       = app_ai_rectifier_sig_valid
				? app_ai_rectifier_sig_tail
				: app_ai_rectifier_xspi2_signature_tail;
		sig_valid      = app_ai_rectifier_sig_valid;
		programmed_size = app_ai_rectifier_programmed_size;
	} else {
		sig_start      = app_ai_scalar_sig_valid
				? app_ai_scalar_sig_start
				: app_ai_xspi2_signature_start;
		sig_tail       = app_ai_scalar_sig_valid
				? app_ai_scalar_sig_tail
				: app_ai_xspi2_signature_tail;
		sig_valid      = app_ai_scalar_sig_valid;
		programmed_size = app_ai_scalar_programmed_size;
	}

	if (!AppAI_Xspi2ReadFlashProbe(stage->xspi2_chip_offset, 0U,
			sig_start, APP_AI_XSPI2_PROBE_BYTES)) {
		/* Log the actual flash bytes so stale hardcoded signatures can be updated. */
		{
			uint8_t actual[APP_AI_XSPI2_PROBE_BYTES] = { 0U };
			char vlog[128];
			(void) BSP_XSPI_NOR_Read(0U, actual,
					stage->xspi2_chip_offset, APP_AI_XSPI2_PROBE_BYTES);
			(void) snprintf(vlog, sizeof(vlog),
					"[AI] %s verify fail: flash=[%02X%02X%02X%02X%02X%02X%02X%02X"
					"%02X%02X%02X%02X%02X%02X%02X%02X] "
					"expected=[%02X%02X%02X%02X%02X%02X%02X%02X"
					"%02X%02X%02X%02X%02X%02X%02X%02X]\r\n",
					stage->stage_label,
					actual[0],actual[1],actual[2],actual[3],
					actual[4],actual[5],actual[6],actual[7],
					actual[8],actual[9],actual[10],actual[11],
					actual[12],actual[13],actual[14],actual[15],
					sig_start[0],sig_start[1],sig_start[2],sig_start[3],
					sig_start[4],sig_start[5],sig_start[6],sig_start[7],
					sig_start[8],sig_start[9],sig_start[10],sig_start[11],
					sig_start[12],sig_start[13],sig_start[14],sig_start[15]);
			(void) DebugConsole_WriteString(vlog);
		}
		return false;
	}

	if (sig_valid && (programmed_size >= APP_AI_XSPI2_PROBE_BYTES)
			&& !AppAI_Xspi2ReadFlashProbe(stage->xspi2_chip_offset,
					programmed_size - APP_AI_XSPI2_PROBE_BYTES,
					sig_tail, APP_AI_XSPI2_PROBE_BYTES)) {
		{
			char vlog[64];
			(void) snprintf(vlog, sizeof(vlog),
					"[AI] %s flash verify: tail mismatch.\r\n",
					stage->stage_label);
			(void) DebugConsole_WriteString(vlog);
		}
		return false;
	}

