rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	return true;
}

static bool AppAI_ProgramXspi2ModelImageFromSd(void) {
	FX_MEDIA *media_ptr = NULL;
	FX_FILE model_file = { 0 };
	ULONG file_size = 0U;
	ULONG bytes_read = 0U;
	ULONG bytes_remaining = 0U;
	ULONG flash_offset = 0U;
	UINT fx_status = FX_SUCCESS;
	UINT tx_status = TX_SUCCESS;
	int32_t bsp_status = BSP_ERROR_NONE;

	if (!AppAI_WaitForFileXMediaReady(APP_AI_FILEX_MEDIA_READY_TIMEOUT_MS)) {
		AppAI_LogXspi2LoadFailure("FileX not ready", FX_MEDIA_NOT_OPEN,
				BSP_ERROR_NONE);
		return false;
	}

	tx_status = AppFileX_AcquireMediaLock();
	if (tx_status != TX_SUCCESS) {
		AppAI_LogXspi2LoadFailure("media lock", (UINT) tx_status, BSP_ERROR_NONE);
		return false;
	}

	media_ptr = AppFileX_GetMediaHandle();
	if (media_ptr == NULL) {
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("media handle", FX_MEDIA_NOT_OPEN,
				BSP_ERROR_NONE);
		return false;
	}

	if (fx_directory_default_set(media_ptr, FX_NULL) != FX_SUCCESS) {
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("default directory", FX_SUCCESS,
				BSP_ERROR_NONE);
		return false;
	}

	fx_status = fx_file_open(media_ptr, &model_file,
			(CHAR *) APP_AI_XSPI2_MODEL_IMAGE_PATH, FX_OPEN_FOR_READ);
	if (fx_status != FX_SUCCESS) {
		(void) fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("file open", fx_status, BSP_ERROR_NONE);
		return false;
	}

	file_size = model_file.fx_file_current_file_size;
	if (file_size == 0U) {
		(void) fx_file_close(&model_file);
		(void) fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("file size (empty)", FX_SUCCESS, BSP_ERROR_NONE);
		return false;
	}
	DebugConsole_Printf("[AI] Model file size: %lu bytes.\r\n",
			(unsigned long) file_size);

	fx_status = fx_file_seek(&model_file, 0U);
	if (fx_status != FX_SUCCESS) {
		(void) fx_file_close(&model_file);
		(void) fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("file seek", fx_status, BSP_ERROR_NONE);
		return false;
	}

	if (!AppAI_LogXspi2ModelFilePrefix(&model_file)) {
		(void) fx_file_close(&model_file);
		(void) fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("source prefix", FX_SUCCESS,
				BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}

	for (ULONG erase_addr = 0U; erase_addr < file_size;
			erase_addr += APP_AI_XSPI2_ERASE_BLOCK_BYTES) {
		if (erase_addr == 0U) {
			(void) DebugConsole_WriteString("[AI] xSPI2 stage erase begin.\r\n");
		}
		bsp_status = BSP_XSPI_NOR_Erase_Block(0U,
				APP_AI_XSPI2_MODEL_CHIP_OFFSET + erase_addr,
				BSP_XSPI_NOR_ERASE_64K);
		if (bsp_status != BSP_ERROR_NONE) {
			(void) fx_file_close(&model_file);
			(void) fx_directory_default_set(media_ptr, FX_NULL);
			AppFileX_ReleaseMediaLock();
			AppAI_LogXspi2LoadFailure("flash erase", FX_SUCCESS, bsp_status);
			return false;
		}
	}

	bytes_remaining = file_size;
	flash_offset = 0U;
	{
		ULONG chunk_index = 0U;

	while (bytes_remaining > 0U) {
		const ULONG chunk_size = (bytes_remaining > APP_AI_XSPI2_PROGRAM_CHUNK_BYTES)
				? APP_AI_XSPI2_PROGRAM_CHUNK_BYTES
				: bytes_remaining;

		if ((flash_offset == 0U)
				|| ((flash_offset % APP_AI_XSPI2_ERASE_BLOCK_BYTES) == 0U)) {
			AppAI_LogXspi2ProgramChunkProgress(chunk_index, flash_offset,
					chunk_size);
		}

		bytes_read = 0U;
		fx_status = fx_file_read(&model_file, app_ai_xspi2_program_buffer,
				chunk_size, &bytes_read);
		if ((fx_status != FX_SUCCESS) || (bytes_read != chunk_size)) {
			(void) fx_file_close(&model_file);
			(void) fx_directory_default_set(media_ptr, FX_NULL);
			AppFileX_ReleaseMediaLock();
			AppAI_LogXspi2LoadFailure("file read", fx_status, BSP_ERROR_NONE);
			return false;
		}

		/* Keep the flash writer honest: the staging buffer is cacheable RAM, so
		 * clean it before BSP_XSPI_NOR_Write() consumes the bytes. */
		(void) mcu_cache_clean_range((uint32_t) (uintptr_t) app_ai_xspi2_program_buffer,
				(uint32_t) (uintptr_t) app_ai_xspi2_program_buffer
						+ (uint32_t) chunk_size);

		bsp_status = BSP_XSPI_NOR_Write(0U, app_ai_xspi2_program_buffer,
				APP_AI_XSPI2_MODEL_CHIP_OFFSET + flash_offset,
				(uint32_t) chunk_size);
		if (bsp_status != BSP_ERROR_NONE) {
			(void) fx_file_close(&model_file);
			(void) fx_directory_default_set(media_ptr, FX_NULL);
			AppFileX_ReleaseMediaLock();
			AppAI_LogXspi2LoadFailure("flash write", FX_SUCCESS, bsp_status);
			return false;
		}

		flash_offset += chunk_size;
		bytes_remaining -= chunk_size;
		chunk_index++;
	}
	}

	(void) fx_file_close(&model_file);
	(void) fx_directory_default_set(media_ptr, FX_NULL);
	AppFileX_ReleaseMediaLock();

	app_ai_xspi2_programmed_size = file_size;
	AppAI_LogXspi2FlashStatus("legacy stage write complete");

	if (!AppAI_ReconfigureXspi2ForRuntime()) {
		AppAI_LogXspi2LoadFailure("runtime reconfigure", FX_SUCCESS,
				BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}
	if (!AppAI_Xspi2EnableMemoryMappedMode()) {
		AppAI_LogXspi2LoadFailure("enable MM after provision", FX_SUCCESS,
				BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}

	AppAI_LogXspi2IndirectAndMappedPrefix();
	AppAI_LogXspi2MappedScaleBytes();

	return true;
}

static void AppAI_SetForcedCrop(const char *label, size_t x_min,
		size_t y_min, size_t width, size_t height) {
	app_ai_forced_crop_active = true;
	app_ai_forced_crop_label = label;
	app_ai_forced_crop_x_min = x_min;
	app_ai_forced_crop_y_min = y_min;
	app_ai_forced_crop_width = width;
	app_ai_forced_crop_height = height;
}

static void AppAI_ClearForcedCrop(void) {
	app_ai_forced_crop_active = false;
	app_ai_forced_crop_label = NULL;
	app_ai_forced_crop_x_min = 0U;
	app_ai_forced_crop_y_min = 0U;
	app_ai_forced_crop_width = 0U;
	app_ai_forced_crop_height = 0U;
}

static const LL_Buffer_InfoTypeDef *AppAI_GetStageInputBufferInfo(
		const AppAI_ModelStageSpec *stage) {
	const LL_Buffer_InfoTypeDef *input_info = NULL;

	if ((stage == NULL) || (stage->nn_instance == NULL)) {
		return NULL;
	}

	input_info = LL_ATON_Input_Buffers_Info(stage->nn_instance);
	if ((input_info == NULL) || (input_info->name == NULL)) {
		return NULL;
	}

