rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	return input_info;
}

static const LL_Buffer_InfoTypeDef *AppAI_GetStageOutputBufferInfo(
		const AppAI_ModelStageSpec *stage) {
	const LL_Buffer_InfoTypeDef *output_info = NULL;

	if ((stage == NULL) || (stage->nn_instance == NULL)) {
		return NULL;
	}

	output_info = LL_ATON_Output_Buffers_Info(stage->nn_instance);
	if ((output_info == NULL) || (output_info->name == NULL)) {
		return NULL;
	}

	return output_info;
}

static bool AppAI_ReadXspi2ModelSourceProbes(FX_FILE *model_file_ptr,
		ULONG file_size, uint8_t *source_prefix, uint8_t *source_tail,
		bool *has_tail_out) {
	ULONG bytes_read = 0U;
	UINT fx_status = FX_SUCCESS;

	if ((model_file_ptr == NULL) || (source_prefix == NULL)
			|| (source_tail == NULL) || (has_tail_out == NULL)) {
		return false;
	}

	*has_tail_out = false;

	fx_status = fx_file_seek(model_file_ptr, 0U);
	if (fx_status != FX_SUCCESS) {
		return false;
	}

	bytes_read = 0U;
	fx_status = fx_file_read(model_file_ptr, source_prefix,
			APP_AI_XSPI2_PROBE_BYTES, &bytes_read);
	if ((fx_status != FX_SUCCESS)
			|| (bytes_read != APP_AI_XSPI2_PROBE_BYTES)) {
		return false;
	}
	AppAI_LogXspi2PrefixBytes("xSPI2 source prefix:", source_prefix);

	if (file_size >= APP_AI_XSPI2_PROBE_BYTES) {
		fx_status = fx_file_seek(model_file_ptr,
				file_size - APP_AI_XSPI2_PROBE_BYTES);
		if (fx_status != FX_SUCCESS) {
			return false;
		}

		bytes_read = 0U;
		fx_status = fx_file_read(model_file_ptr, source_tail,
				APP_AI_XSPI2_PROBE_BYTES, &bytes_read);
		if ((fx_status != FX_SUCCESS)
				|| (bytes_read != APP_AI_XSPI2_PROBE_BYTES)) {
			return false;
		}
		AppAI_LogXspi2PrefixBytes("xSPI2 source tail:", source_tail);
		*has_tail_out = true;
	}

	fx_status = fx_file_seek(model_file_ptr, 0U);
	if (fx_status != FX_SUCCESS) {
		return false;
	}

	return true;
}

static bool AppAI_ProgramXspi2ModelImageFromSdForStage(
		const AppAI_ModelStageSpec *stage) {
	FX_MEDIA *media_ptr = NULL;
	FX_FILE model_file = { 0 };
	ULONG file_size = 0U;
	ULONG bytes_read = 0U;
	ULONG bytes_remaining = 0U;
	ULONG flash_offset = 0U;
	UINT fx_status = FX_SUCCESS;
	UINT tx_status = TX_SUCCESS;
	int32_t bsp_status = BSP_ERROR_NONE;
	uint8_t source_prefix[APP_AI_XSPI2_PROBE_BYTES] = { 0U };
	uint8_t source_tail[APP_AI_XSPI2_PROBE_BYTES] = { 0U };
	bool has_tail_probe = false;

	if ((stage == NULL) || (stage->model_image_path == NULL)) {
		return false;
	}

	if (!AppAI_WaitForFileXMediaReady(APP_AI_FILEX_MEDIA_READY_TIMEOUT_MS)) {
		AppAI_LogXspi2LoadFailure(stage->stage_label, FX_MEDIA_NOT_OPEN,
				BSP_ERROR_NONE);
		return false;
	}

	(void) DebugConsole_WriteString("[AI] xSPI2 stage acquire media lock start.\r\n");
	tx_status = AppFileX_AcquireMediaLock();
	if (tx_status != TX_SUCCESS) {
		AppAI_LogXspi2LoadFailure(stage->stage_label, (UINT) tx_status,
				BSP_ERROR_NONE);
		return false;
	}
	(void) DebugConsole_WriteString("[AI] xSPI2 stage acquire media lock OK.\r\n");

	media_ptr = AppFileX_GetMediaHandle();
	if (media_ptr == NULL) {
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure(stage->stage_label, FX_MEDIA_NOT_OPEN,
				BSP_ERROR_NONE);
		return false;
	}

	(void) DebugConsole_WriteString("[AI] xSPI2 stage media handle OK.\r\n");
	if (fx_directory_default_set(media_ptr, FX_NULL) != FX_SUCCESS) {
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure(stage->stage_label, FX_SUCCESS,
				BSP_ERROR_NONE);
		return false;
	}
	(void) DebugConsole_WriteString("[AI] xSPI2 stage directory reset OK.\r\n");

	(void) DebugConsole_WriteString("[AI] xSPI2 stage file open start.\r\n");
	fx_status = fx_file_open(media_ptr, &model_file,
			(CHAR *) stage->model_image_path, FX_OPEN_FOR_READ);
	if (fx_status != FX_SUCCESS) {
		(void) fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure(stage->stage_label, fx_status, BSP_ERROR_NONE);
		return false;
	}
	(void) DebugConsole_WriteString("[AI] xSPI2 stage file open OK.\r\n");

	file_size = model_file.fx_file_current_file_size;
	if (file_size == 0U) {
		(void) fx_file_close(&model_file);
		(void) fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure(stage->stage_label, FX_SUCCESS,
				BSP_ERROR_NONE);
		return false;
	}
	DebugConsole_Printf("[AI] %s model file size: %lu bytes.\r\n",
			stage->stage_label, (unsigned long) file_size);

	(void) DebugConsole_WriteString("[AI] xSPI2 stage source probes start.\r\n");
	if (!AppAI_ReadXspi2ModelSourceProbes(&model_file, file_size,
			source_prefix, source_tail, &has_tail_probe)) {
		(void) fx_file_close(&model_file);
		(void) fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure(stage->stage_label, FX_SUCCESS,
				BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}
	(void) DebugConsole_WriteString("[AI] xSPI2 stage source probes OK.\r\n");

	for (ULONG erase_addr = 0U; erase_addr < file_size;
			erase_addr += APP_AI_XSPI2_ERASE_BLOCK_BYTES) {
		bsp_status = BSP_XSPI_NOR_Erase_Block(0U,
				stage->xspi2_chip_offset + erase_addr,
				BSP_XSPI_NOR_ERASE_64K);
		if (bsp_status != BSP_ERROR_NONE) {
			(void) fx_file_close(&model_file);
			(void) fx_directory_default_set(media_ptr, FX_NULL);
			AppFileX_ReleaseMediaLock();
			AppAI_LogXspi2LoadFailure(stage->stage_label, FX_SUCCESS,
					bsp_status);
			return false;
		}
	}

	bytes_remaining = file_size;
	flash_offset = 0U;
	{
		ULONG chunk_index = 0U;
		(void) DebugConsole_WriteString("[AI] xSPI2 stage write begin.\r\n");

		while (bytes_remaining > 0U) {
			const ULONG chunk_size = (bytes_remaining > APP_AI_XSPI2_PROGRAM_CHUNK_BYTES)
					? APP_AI_XSPI2_PROGRAM_CHUNK_BYTES
					: bytes_remaining;

			if (chunk_index == 0U) {
				(void) DebugConsole_WriteString(
						"[AI] xSPI2 stage first chunk write start.\r\n");
			}
			if ((flash_offset == 0U)
					|| ((flash_offset % APP_AI_XSPI2_ERASE_BLOCK_BYTES) == 0U)) {
				AppAI_LogXspi2ProgramChunkProgress(chunk_index, flash_offset,
						chunk_size);
			}

			bytes_read = 0U;
			fx_status = fx_file_read(&model_file, app_ai_xspi2_program_buffer,
					chunk_size, &bytes_read);
			if ((fx_status != FX_SUCCESS) || (bytes_read != chunk_size)) {
				(void) fx_file_close(&model_file);
				(void) fx_directory_default_set(media_ptr, FX_NULL);
				AppFileX_ReleaseMediaLock();
				AppAI_LogXspi2LoadFailure(stage->stage_label, fx_status,
						BSP_ERROR_NONE);
				return false;
			}

			/* Keep the flash writer honest: clean the staging buffer cache lines
			 * before BSP_XSPI_NOR_Write() reads the fresh file contents. */
			(void) mcu_cache_clean_range((uint32_t) (uintptr_t) app_ai_xspi2_program_buffer,
					(uint32_t) (uintptr_t) app_ai_xspi2_program_buffer
							+ (uint32_t) chunk_size);

			bsp_status = BSP_XSPI_NOR_Write(0U, app_ai_xspi2_program_buffer,
					stage->xspi2_chip_offset + flash_offset,
					(uint32_t) chunk_size);
			if (bsp_status != BSP_ERROR_NONE) {
				(void) fx_file_close(&model_file);
				(void) fx_directory_default_set(media_ptr, FX_NULL);
				AppFileX_ReleaseMediaLock();
				AppAI_LogXspi2LoadFailure(stage->stage_label, FX_SUCCESS,
						bsp_status);
				return false;
			}

			flash_offset += chunk_size;
			bytes_remaining -= chunk_size;
			chunk_index++;
		}
	}
	(void) DebugConsole_WriteString("[AI] xSPI2 stage write complete.\r\n");
	AppAI_LogXspi2FlashStatus("rectifier stage write complete");

	/* Probe the first 16 bytes back from flash immediately after write (still in
	 * indirect/write mode) to confirm the data landed at the expected address. */
	{
		uint8_t post_write[APP_AI_XSPI2_PROBE_BYTES] = { 0U };
		char pwlog[128];
		(void) BSP_XSPI_NOR_Read(0U, post_write,
				stage->xspi2_chip_offset, APP_AI_XSPI2_PROBE_BYTES);
		(void) snprintf(pwlog, sizeof(pwlog),
				"[AI] %s post-write probe: [%02X%02X%02X%02X%02X%02X%02X%02X"
				"%02X%02X%02X%02X%02X%02X%02X%02X] "
				"src=[%02X%02X%02X%02X%02X%02X%02X%02X"
				"%02X%02X%02X%02X%02X%02X%02X%02X]\r\n",
				stage->stage_label,
				post_write[0],post_write[1],post_write[2],post_write[3],
				post_write[4],post_write[5],post_write[6],post_write[7],
				post_write[8],post_write[9],post_write[10],post_write[11],
				post_write[12],post_write[13],post_write[14],post_write[15],
				source_prefix[0],source_prefix[1],source_prefix[2],source_prefix[3],
				source_prefix[4],source_prefix[5],source_prefix[6],source_prefix[7],
				source_prefix[8],source_prefix[9],source_prefix[10],source_prefix[11],
				source_prefix[12],source_prefix[13],source_prefix[14],source_prefix[15]);
		(void) DebugConsole_WriteString(pwlog);
	}

