rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	(void) fx_file_close(&model_file);
	(void) fx_directory_default_set(media_ptr, FX_NULL);
	AppFileX_ReleaseMediaLock();

	app_ai_xspi2_programmed_size = file_size;
	/* Update the per-stage size so the verify tail-probe uses the right offset
	 * regardless of which stage was provisioned last. */
	if (strcmp(stage->stage_label, "rectifier") == 0) {
		app_ai_rectifier_programmed_size = file_size;
		(void) memcpy(app_ai_rectifier_sig_start, source_prefix,
				APP_AI_XSPI2_PROBE_BYTES);
		(void) memcpy(app_ai_rectifier_sig_tail, source_tail,
				APP_AI_XSPI2_PROBE_BYTES);
		app_ai_rectifier_sig_valid = has_tail_probe;
	} else {
		app_ai_scalar_programmed_size = file_size;
		(void) memcpy(app_ai_scalar_sig_start, source_prefix,
				APP_AI_XSPI2_PROBE_BYTES);
		(void) memcpy(app_ai_scalar_sig_tail, source_tail,
				APP_AI_XSPI2_PROBE_BYTES);
		app_ai_scalar_sig_valid = has_tail_probe;
	}

	if (!AppAI_ReconfigureXspi2ForRuntime()) {
		AppAI_LogXspi2LoadFailure(stage->stage_label, FX_SUCCESS,
				BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}
	if (!AppAI_Xspi2EnableMemoryMappedMode()) {
		AppAI_LogXspi2LoadFailure("enable MM after provision", FX_SUCCESS,
				BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}

	(void) DebugConsole_WriteString(
			"[AI] xSPI2 stage provisioning complete; verify skipped.\r\n");
	AppAI_LogXspi2IndirectAndMappedPrefix();
	AppAI_LogXspi2MappedScaleBytes();
	app_ai_loaded_xspi2_stage = stage;
	DebugConsole_Printf("[AI] %s xSPI2 model image ready.\r\n",
			stage->stage_label);
	return true;
}

static bool AppAI_EnsureXspi2ModelImageReadyForStage(
		const AppAI_ModelStageSpec *stage) {
	if (stage == NULL) {
		return false;
	}

	/* Fast path: pointer equality means this stage is already in its flash
	 * region and the peripheral is already in mapped mode for it. */
	if (app_ai_loaded_xspi2_stage == stage) {
		(void) DebugConsole_WriteString("[AI] xSPI2 stage already loaded.\r\n");
		return true;
	}

	/* Each stage now has its own flash region, so we can verify whether the
	 * stage's bytes are already present without disturbing the other stage.
	 * Switch to indirect mode first (needed for BSP_XSPI_NOR_Read). */
	(void) DebugConsole_WriteString("[AI] xSPI2 stage mapped verify start.\r\n");
	(void) DebugConsole_WriteString("[AI] xSPI2 stage reconfigure start.\r\n");
	if (!AppAI_ReconfigureXspi2ForRuntime()) {
		AppAI_LogXspi2LoadFailure("runtime reconfigure", FX_SUCCESS,
				BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}
	(void) DebugConsole_WriteString("[AI] xSPI2 stage reconfigure OK.\r\n");

	if (AppAI_Xspi2ModelImageMatchesMappedFlashForStage(stage)) {
		(void) DebugConsole_WriteString(
				"[AI] xSPI2 stage image already present.\r\n");
		if (!AppAI_Xspi2EnableMemoryMappedMode()) {
			AppAI_LogXspi2LoadFailure("enable MM after verify", FX_SUCCESS,
					BSP_ERROR_COMPONENT_FAILURE);
			return false;
		}
		app_ai_loaded_xspi2_stage = stage;
		return true;
	}

	/* Models are permanently flashed via flash_boot.bat — SD provisioning is
	 * disabled. A signature mismatch means the wrong binary is in flash; use
	 * flash_boot.bat with FLASH_MODEL=1 to update. */
	DebugConsole_Printf(
			"[AI] xSPI2 stage '%s' signature mismatch — reflash with flash_boot.bat FLASH_MODEL=1.\r\n",
			stage->stage_label);
	return false;
}

static bool AppAI_EnsureStageRuntimeReady(const AppAI_ModelStageSpec *stage) {
	if (stage == NULL) {
		return false;
	}

	(void) DebugConsole_WriteString("[AI] Stage runtime ready start.\r\n");
	(void) DebugConsole_WriteString(stage->stage_label != NULL
			&& (strcmp(stage->stage_label, "rectifier") == 0)
			? "[AI] Stage label: rectifier\r\n"
			: "[AI] Stage label: scalar\r\n");
	if (!AppAI_EnsureXspi2ModelImageReadyForStage(stage)) {
		(void) DebugConsole_WriteString(
				"[AI] Stage runtime ready failed during xSPI2 setup.\r\n");
		return false;
	}

	(void) DebugConsole_WriteString("[AI] Stage network init start.\r\n");
	if ((stage->network_init_fn == NULL) || !stage->network_init_fn()) {
		AppAI_LogInitFailure(stage->stage_label);
		return false;
	}

	LL_ATON_RT_Init_Network(stage->nn_instance);
	(void) DebugConsole_WriteString("[AI] Stage network init OK.\r\n");

	(void) DebugConsole_WriteString("[AI] Stage inference init start.\r\n");
	if ((stage->inference_init_fn == NULL) || !stage->inference_init_fn()) {
		AppAI_LogInitFailure(stage->stage_label);
		return false;
	}

	(void) DebugConsole_WriteString("[AI] Stage inference init OK.\r\n");
	return true;
}

static bool AppAI_DecodeRectifierCropBox(
		const LL_Buffer_InfoTypeDef *output_buffer_info,
		AppAI_SourceCrop *crop_out,
		AppAI_RectifierBox *rectifier_box_out) {
	const float *output_ptr = NULL;
	const size_t source_width = (size_t) APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t source_height = (size_t) APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	float center_x = 0.0f;
	float center_y = 0.0f;
	float box_w = 0.0f;
	float box_h = 0.0f;
	float crop_x_min_f = 0.0f;
	float crop_y_min_f = 0.0f;
	float crop_width_f = 0.0f;
	float crop_height_f = 0.0f;
	bool use_fixed_training_crop = false;

	if ((output_buffer_info == NULL) || (crop_out == NULL)) {
		return false;
	}

	output_ptr = (const float *) LL_Buffer_addr_start(output_buffer_info);
	if ((output_ptr == NULL) || (LL_Buffer_len(output_buffer_info) < (sizeof(float) * 4U))) {
		return false;
	}

	/* Log the raw rectifier output before any clamping so we can distinguish
	 * between the model producing a plausible box that the fallback rejects,
	 * a near-zero output (model not running / zero-init), or an out-of-range
	 * value (wrong output format / normalization mismatch).
	 * Use WriteString+snprintf so this survives APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS=0. */
	{
		union { float f; uint32_t u; } r0, r1, r2, r3;
		char rect_log[192];
		r0.f = output_ptr[0]; r1.f = output_ptr[1];
		r2.f = output_ptr[2]; r3.f = output_ptr[3];
		(void) snprintf(rect_log, sizeof(rect_log),
				"[AI] Rect out: cx=%ld cy=%ld w=%ld h=%ld "
				"bits=[%08lX %08lX %08lX %08lX]\r\n",
				(long) (output_ptr[0] * 1000.0f),
				(long) (output_ptr[1] * 1000.0f),
				(long) (output_ptr[2] * 1000.0f),
				(long) (output_ptr[3] * 1000.0f),
				(unsigned long) r0.u, (unsigned long) r1.u,
				(unsigned long) r2.u, (unsigned long) r3.u);
		(void) DebugConsole_WriteString(rect_log);
	}

	center_x = AppAI_ClampNormalizedFloat(output_ptr[0]);
	center_y = AppAI_ClampNormalizedFloat(output_ptr[1]);
	box_w = AppAI_ClampNormalizedFloat(output_ptr[2]);
	box_h = AppAI_ClampNormalizedFloat(output_ptr[3]);
	if (box_w < APP_AI_RECTIFIER_MIN_BOX_RATIO) {
		box_w = APP_AI_RECTIFIER_MIN_BOX_RATIO;
	}
	if (box_h < APP_AI_RECTIFIER_MIN_BOX_RATIO) {
		box_h = APP_AI_RECTIFIER_MIN_BOX_RATIO;
	}

	if (rectifier_box_out != NULL) {
		rectifier_box_out->center_x = center_x;
		rectifier_box_out->center_y = center_y;
		rectifier_box_out->box_w = box_w;
		rectifier_box_out->box_h = box_h;
	}

	if ((box_w < APP_AI_RECTIFIER_FALLBACK_MIN_BOX_RATIO)
			|| (box_h < APP_AI_RECTIFIER_FALLBACK_MIN_BOX_RATIO)
			|| (box_w > APP_AI_RECTIFIER_FALLBACK_MAX_BOX_RATIO)
			|| (box_h > APP_AI_RECTIFIER_FALLBACK_MAX_BOX_RATIO)) {
		{
			char fb_log[96];
			(void) snprintf(fb_log, sizeof(fb_log),
					"[AI] Rect fallback: cx=%ld cy=%ld w=%ld h=%ld lim=[%ld..%ld]\r\n",
					(long) (center_x * 1000.0f), (long) (center_y * 1000.0f),
					(long) (box_w * 1000.0f), (long) (box_h * 1000.0f),
					(long) (APP_AI_RECTIFIER_FALLBACK_MIN_BOX_RATIO * 1000.0f),
					(long) (APP_AI_RECTIFIER_FALLBACK_MAX_BOX_RATIO * 1000.0f));
			(void) DebugConsole_WriteString(fb_log);
		}
		use_fixed_training_crop = true;
	}

	if (use_fixed_training_crop) {
		/* Keep the scalar reader on the same stable crop that the offline
		 * training/evaluation path uses when the rectifier output is implausible.
		 * That avoids 1x1/tiny crops and avoids treating full-frame predictions
		 * as if they were useful dial boxes. */
		crop_out->x_min = (size_t) ((float) source_width
				* APP_AI_TRAINING_CROP_X_MIN_RATIO);
		crop_out->y_min = (size_t) ((float) source_height
				* APP_AI_TRAINING_CROP_Y_MIN_RATIO);
		crop_out->width = (size_t) ((float) source_width
				* (APP_AI_TRAINING_CROP_X_MAX_RATIO
				- APP_AI_TRAINING_CROP_X_MIN_RATIO));
		crop_out->height = (size_t) ((float) source_height
				* (APP_AI_TRAINING_CROP_Y_MAX_RATIO
				- APP_AI_TRAINING_CROP_Y_MIN_RATIO));
		if (crop_out->width == 0U) {
			crop_out->width = 1U;
		}
		if (crop_out->height == 0U) {
			crop_out->height = 1U;
		}
		DebugConsole_WriteString(
				"[AI] Rectifier crop fallback: using fixed training crop.\r\n");
		return true;
	}

	crop_width_f = ((float) source_width) * box_w * APP_AI_RECTIFIER_CROP_SCALE;
	crop_height_f = ((float) source_height) * box_h * APP_AI_RECTIFIER_CROP_SCALE;
	if (crop_width_f < 1.0f) {
		crop_width_f = 1.0f;
	}
	if (crop_height_f < 1.0f) {
		crop_height_f = 1.0f;
	}

