rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	crop_x_min_f = (((float) source_width) * center_x) - (crop_width_f * 0.5f);
	crop_y_min_f = (((float) source_height) * center_y) - (crop_height_f * 0.5f);
	if (crop_x_min_f < 0.0f) {
		crop_x_min_f = 0.0f;
	}
	if (crop_y_min_f < 0.0f) {
		crop_y_min_f = 0.0f;
	}
	if ((crop_x_min_f + crop_width_f) > (float) source_width) {
		crop_x_min_f = (float) source_width - crop_width_f;
	}
	if ((crop_y_min_f + crop_height_f) > (float) source_height) {
		crop_y_min_f = (float) source_height - crop_height_f;
	}
	if (crop_x_min_f < 0.0f) {
		crop_x_min_f = 0.0f;
	}
	if (crop_y_min_f < 0.0f) {
		crop_y_min_f = 0.0f;
	}

	crop_out->x_min = (size_t) (crop_x_min_f + 0.5f);
	crop_out->y_min = (size_t) (crop_y_min_f + 0.5f);
	crop_out->width = (size_t) (crop_width_f + 0.5f);
	crop_out->height = (size_t) (crop_height_f + 0.5f);

	if (crop_out->width == 0U) {
		crop_out->width = 1U;
	}
	if (crop_out->height == 0U) {
		crop_out->height = 1U;
	}
	if (crop_out->x_min >= source_width) {
		crop_out->x_min = source_width - 1U;
	}
	if (crop_out->y_min >= source_height) {
		crop_out->y_min = source_height - 1U;
	}
	if ((crop_out->x_min + crop_out->width) > source_width) {
		crop_out->width = source_width - crop_out->x_min;
	}
	if ((crop_out->y_min + crop_out->height) > source_height) {
		crop_out->height = source_height - crop_out->y_min;
	}

	return true;
}

static void AppAI_LogRectifierResult(
		const LL_Buffer_InfoTypeDef *output_buffer_info,
		const AppAI_RectifierBox *rectifier_box) {
	if ((output_buffer_info == NULL) || (rectifier_box == NULL)) {
		DebugConsole_Printf("[AI] Rectifier output missing.\r\n");
		return;
	}

	DebugConsole_Printf("[AI] Rectifier output: name=%s addr=%p len=%lu\r\n",
			(output_buffer_info->name != NULL) ? output_buffer_info->name
					: "(unnamed)",
			LL_Buffer_addr_start(output_buffer_info),
			(unsigned long) LL_Buffer_len(output_buffer_info));
	DebugConsole_Printf(
			"[AI] Rectifier box: cx=%.6f cy=%.6f w=%.6f h=%.6f\r\n",
			rectifier_box->center_x, rectifier_box->center_y,
			rectifier_box->box_w, rectifier_box->box_h);
}

static bool AppAI_RunStageInference(const AppAI_ModelStageSpec *stage,
		const uint8_t *frame_bytes, size_t frame_size,
		const AppAI_SourceCrop *forced_crop,
		const LL_Buffer_InfoTypeDef **output_info_out) {
	const LL_Buffer_InfoTypeDef *input_info = NULL;
	const LL_Buffer_InfoTypeDef *output_info = NULL;
	float *input_ptr = NULL;
	size_t input_len_bytes = 0U;
	size_t input_float_count = 0U;
	const float *output_ptr = NULL;
	size_t output_len_bytes = 0U;

	if ((stage == NULL) || (frame_bytes == NULL)) {
		return false;
	}

	(void) DebugConsole_WriteString("[AI] Stage inference request.\r\n");
	(void) DebugConsole_WriteString(stage->stage_label != NULL
			&& (strcmp(stage->stage_label, "rectifier") == 0)
			? "[AI] Stage inference request label: rectifier\r\n"
			: "[AI] Stage inference request label: scalar\r\n");
	if (!AppAI_EnsureStageRuntimeReady(stage)) {
		(void) DebugConsole_WriteString(
				"[AI] Stage inference aborted before preprocess.\r\n");
		return false;
	}

	input_info = AppAI_GetStageInputBufferInfo(stage);
	output_info = AppAI_GetStageOutputBufferInfo(stage);
	if ((input_info == NULL) || (output_info == NULL)) {
		return false;
	}

	input_ptr = (float *) LL_Buffer_addr_start(input_info);
	input_len_bytes = (size_t) LL_Buffer_len(input_info);
	input_float_count = input_len_bytes / sizeof(float);
	if (input_ptr == NULL) {
		return false;
	}

	if (forced_crop != NULL) {
		AppAI_SetForcedCrop(stage->stage_label, forced_crop->x_min,
				forced_crop->y_min, forced_crop->width, forced_crop->height);
	} else {
		AppAI_ClearForcedCrop();
	}

	DebugConsole_Printf(
			"[AI] Run stage=%s frame_ptr=%p frame_size=%lu input=%s addr=%p len=%lu output=%s addr=%p len=%lu\r\n",
			stage->stage_label, (const void *) frame_bytes,
			(unsigned long) frame_size,
			(input_info->name != NULL) ? input_info->name : "(unnamed)",
			(void *) input_ptr, (unsigned long) input_len_bytes,
			(output_info->name != NULL) ? output_info->name : "(unnamed)",
			(void *) LL_Buffer_addr_start(output_info),
			(unsigned long) LL_Buffer_len(output_info));

	if (!AppAI_PreprocessYuv422FrameToFloatInput(frame_bytes, frame_size,
			input_ptr, input_float_count)) {
		AppAI_ClearForcedCrop();
		return false;
	}

	DebugConsole_Printf("[AI] %s preprocess complete; logging tensor signatures.\r\n",
			stage->stage_label);
	AppAI_LogFrameSignature(frame_bytes, frame_size);
	AppAI_LogInputSignature(input_ptr, input_float_count);
	AppAI_LogInputTensorWindow(input_ptr, input_float_count);
	AppAI_LogInputProbeSummary(input_ptr, input_float_count);
	AppAI_LogTensorPatch("Tensor center", input_ptr,
			(size_t) APP_AI_CAPTURE_FRAME_WIDTH_PIXELS,
			(size_t) APP_AI_CAPTURE_FRAME_WIDTH_PIXELS / 2U,
			(size_t) APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS / 2U, 2U);

	(void) mcu_cache_clean_range((uint32_t) (uintptr_t) input_ptr,
			(uint32_t) ((uintptr_t) input_ptr + input_len_bytes));

	LL_ATON_RT_Reset_Network(stage->nn_instance);

	for (uint32_t epoch_step = 0U;; ++epoch_step) {
		const LL_ATON_RT_RetValues_t run_status =
				LL_ATON_RT_RunEpochBlock(stage->nn_instance);

		if (run_status == LL_ATON_RT_DONE) {
			break;
		}

		if (run_status == LL_ATON_RT_WFE) {
			LL_ATON_OSAL_WFE();
		} else {
			tx_thread_relinquish();
		}
	}

	output_ptr = (const float *) LL_Buffer_addr_start(output_info);
	output_len_bytes = (size_t) LL_Buffer_len(output_info);
	if ((output_ptr == NULL) || (output_len_bytes < sizeof(float))) {
		AppAI_ClearForcedCrop();
		return false;
	}

	(void) mcu_cache_invalidate_range((uint32_t) (uintptr_t) output_ptr,
			(uint32_t) ((uintptr_t) output_ptr + output_len_bytes));

	/* Log raw output bytes immediately after cache invalidate so we can tell
	 * whether the inference engine populated the buffer at all. */
	{
		const uint8_t *ob = (const uint8_t *) output_ptr;
		const size_t on = (output_len_bytes < 16U) ? output_len_bytes : 16U;
		char olog[128];
		(void) snprintf(olog, sizeof(olog),
				"[AI] %s out addr=%p len=%lu bytes=[%02X%02X%02X%02X%02X%02X%02X%02X"
				"%02X%02X%02X%02X%02X%02X%02X%02X]\r\n",
				stage->stage_label, (const void *) output_ptr,
				(unsigned long) output_len_bytes,
				(on>0U)?ob[0]:0U,(on>1U)?ob[1]:0U,
				(on>2U)?ob[2]:0U,(on>3U)?ob[3]:0U,
				(on>4U)?ob[4]:0U,(on>5U)?ob[5]:0U,
				(on>6U)?ob[6]:0U,(on>7U)?ob[7]:0U,
				(on>8U)?ob[8]:0U,(on>9U)?ob[9]:0U,
				(on>10U)?ob[10]:0U,(on>11U)?ob[11]:0U,
				(on>12U)?ob[12]:0U,(on>13U)?ob[13]:0U,
				(on>14U)?ob[14]:0U,(on>15U)?ob[15]:0U);
		(void) DebugConsole_WriteString(olog);
	}

	if (output_info_out != NULL) {
		*output_info_out = output_info;
	}

