rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	AppAI_ClearForcedCrop();
	return true;
}

static bool AppAI_WaitForFileXMediaReady(uint32_t timeout_ms) {
	const ULONG timeout_ticks = (ULONG) ((timeout_ms + 9U) / 10U);
	const ULONG start_tick = tx_time_get();

	while (!AppFileX_IsMediaReady()) {
		if ((tx_time_get() - start_tick) >= timeout_ticks) {
			return false;
		}

		tx_thread_sleep(1U);
	}

	return true;
}

static bool AppAI_EnsureXspi2ModelImageReady(void) {
	if (app_ai_xspi2_initialized) {
		return true;
	}

	/* The runtime consumes the blob through the mapped xSPI2 window, so verify
	 * that view first. Some boots leave the indirect probe path in a misleading
	 * state even when the programmed image is still present. */
	if (!AppAI_ReconfigureXspi2ForRuntime()) {
		AppAI_LogXspi2LoadFailure("runtime reconfigure", FX_SUCCESS,
				BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}
	if (!AppAI_Xspi2EnableMemoryMappedMode()) {
		AppAI_LogXspi2LoadFailure("enable MM for verify", FX_SUCCESS,
				BSP_ERROR_COMPONENT_FAILURE);
		return false;
	}

	if (AppAI_Xspi2ModelImageMatchesMappedFlash()) {
		DebugConsole_Printf(
				"[AI] xSPI2 model image already present; skipping provisioning.\r\n");
		AppAI_LogXspi2IndirectAndMappedPrefix();
		AppAI_LogXspi2MappedScaleBytes();
	} else {
		DebugConsole_Printf(
				"[AI] xSPI2 model image missing or stale; programming from SD card.\r\n");
		if (!AppAI_EnsureXspi2MemoryReady()) {
			AppAI_LogXspi2LoadFailure("xSPI2 memory", FX_SUCCESS,
					BSP_ERROR_COMPONENT_FAILURE);
			return false;
		}

		if (!AppAI_ProgramXspi2ModelImageFromSd()) {
			DebugConsole_Printf(
					"[AI] xSPI2 model image provisioning failed.\r\n");
			return false;
		}
	}

	if (!AppAI_Xspi2ModelImageMatchesMappedFlash()) {
		DebugConsole_Printf(
				"[AI] xSPI2 mapped verify failed after provisioning.\r\n");
	}

	app_ai_xspi2_initialized = true;
	DebugConsole_Printf("[AI] xSPI2 model image ready.\r\n");
	return true;
}

bool App_AI_Model_Init(void) {
	if (app_ai_runtime_initialized) {
		return true;
	}

	(void) DebugConsole_WriteString("[AI] Model runtime init start.\r\n");
	if (!AppAI_EnsureNpuHardwareReady()) {
		AppAI_LogInitFailure("NPU hardware");
		return false;
	}

	if (!AppAI_RuntimeInitStepwise()) {
		AppAI_LogInitFailure("runtime init");
		return false;
	}

	app_ai_runtime_initialized = true;
	DebugConsole_Printf("[AI] Model runtime init OK.\r\n");
	return true;
}

static void AppAI_LogInitFailure(const char *step) {
	if (step != NULL) {
		DebugConsole_Printf("[AI] Model runtime init failed at %s.\r\n", step);
	} else {
		DebugConsole_Printf("[AI] Model runtime init failed.\r\n");
	}
}

static void AppAI_LogXspi2LoadFailure(const char *step, UINT fx_status,
		int32_t bsp_status) {
	DebugConsole_Printf("[AI] xSPI2 load failed at %s (fx=%lu bsp=%ld).\r\n",
			(step != NULL) ? step : "unknown",
			(unsigned long) fx_status,
			(long) bsp_status);
}

static void AppAI_LogXspi2ProgramChunkProgress(ULONG chunk_index,
		ULONG flash_offset, ULONG chunk_size) {
	DebugConsole_Printf(
			"[AI] xSPI2 program chunk %lu offset=0x%08lX size=%lu.\r\n",
			(unsigned long) chunk_index,
			(unsigned long) flash_offset,
			(unsigned long) chunk_size);
}

static void AppAI_LogXspi2FlashStatus(const char *label) {
	/* Read both the generic BSP status and the raw security/status bytes so we
	 * can distinguish write protection, suspend state, and a plain readback bug. */
	uint8_t security_reg = 0U;
	uint8_t status_reg = 0U;
	int32_t bsp_status = BSP_XSPI_NOR_GetStatus(0U);
	int32_t security_status = MX25UM51245G_ReadSecurityRegister(&hxspi_nor[0U],
			Xspi_Nor_Ctx[0U].InterfaceMode, Xspi_Nor_Ctx[0U].TransferRate,
			&security_reg);
	int32_t status_reg_status = MX25UM51245G_ReadStatusRegister(&hxspi_nor[0U],
			Xspi_Nor_Ctx[0U].InterfaceMode, Xspi_Nor_Ctx[0U].TransferRate,
			&status_reg);
	char msg[192];

	(void) snprintf(
			msg,
			sizeof(msg),
			"[AI] %s flash status=%ld sec=%ld sec_reg=0x%02X sr=%ld sr_reg=0x%02X mode=%u rate=%u.\r\n",
			(label != NULL) ? label : "xSPI2",
			(long) bsp_status,
			(long) security_status,
			(unsigned int) security_reg,
			(long) status_reg_status,
			(unsigned int) status_reg,
			(unsigned int) Xspi_Nor_Ctx[0U].InterfaceMode,
			(unsigned int) Xspi_Nor_Ctx[0U].TransferRate);
	(void) DebugConsole_WriteString(msg);
}

static void AppAI_LogXspi2FlashPrefix(void) {
	uint8_t flash_bytes[APP_AI_XSPI2_PROBE_BYTES] = { 0U };

	if (BSP_XSPI_NOR_Read(0U, flash_bytes, 0U,
			APP_AI_XSPI2_PROBE_BYTES) != BSP_ERROR_NONE) {
		DebugConsole_Printf("[AI] xSPI2 prefix readback failed.\r\n");
		return;
	}

	AppAI_LogXspi2PrefixBytes("xSPI2 prefix readback:", flash_bytes);
}

static void AppAI_LogXspi2MappedScaleBytes(void) {
	if (app_ai_xspi2_programmed_size < 4U) {
		return;
	}
	const uint8_t *const tail_ptr = (const uint8_t *) (APP_AI_XSPI2_MODEL_BASE_ADDR
			+ app_ai_xspi2_programmed_size - 4U);

	(void) mcu_cache_invalidate_range((uint32_t) (uintptr_t) tail_ptr,
			(uint32_t) ((uintptr_t) tail_ptr + 4U));

	DebugConsole_Printf(
			"[AI] xSPI2 mapped tail bytes @%p = %02X %02X %02X %02X\r\n",
			(const void *) tail_ptr, tail_ptr[0], tail_ptr[1], tail_ptr[2],
			tail_ptr[3]);
}

static void AppAI_LogXspi2IndirectAndMappedPrefix(void) {
	uint8_t indirect_bytes[APP_AI_XSPI2_PROBE_BYTES] = { 0U };
	uint8_t mapped_bytes[APP_AI_XSPI2_PROBE_BYTES] = { 0U };
	const int32_t disable_status = BSP_XSPI_NOR_DisableMemoryMappedMode(0U);

	if (disable_status != BSP_ERROR_NONE) {
		DebugConsole_Printf(
				"[AI] xSPI2 disable-mapped before compare returned %ld.\r\n",
				(long) disable_status);
	}

	if (BSP_XSPI_NOR_Read(0U, indirect_bytes, 0U,
			APP_AI_XSPI2_PROBE_BYTES) != BSP_ERROR_NONE) {
		DebugConsole_Printf("[AI] xSPI2 indirect prefix read failed.\r\n");
	} else {
		AppAI_LogXspi2PrefixBytes("xSPI2 indirect prefix:", indirect_bytes);
	}

	if (BSP_XSPI_NOR_EnableMemoryMappedMode(0U) != BSP_ERROR_NONE) {
		DebugConsole_Printf("[AI] xSPI2 re-enable mapped compare failed.\r\n");
		return;
	}

	(void) mcu_cache_invalidate_range(APP_AI_XSPI2_MODEL_BASE_ADDR,
			APP_AI_XSPI2_MODEL_BASE_ADDR + APP_AI_XSPI2_PROBE_BYTES);
	(void) memcpy(mapped_bytes, (const void *) APP_AI_XSPI2_MODEL_BASE_ADDR,
			APP_AI_XSPI2_PROBE_BYTES);
	AppAI_LogXspi2PrefixBytes("xSPI2 mapped prefix:", mapped_bytes);
}

