rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	}
	HAL_RIF_RISAF_ConfigBaseRegion(risaf_hw, 0U, &risaf_conf);
	if (risaf == RISAF12_S) {
		
	}

	risaf_conf.Secure = RIF_ATTRIBUTE_NSEC;
	if (risaf == RISAF12_S) {
		
	}
	HAL_RIF_RISAF_ConfigBaseRegion(risaf_hw, 1U, &risaf_conf);
	if (risaf == RISAF12_S) {
		
	}
}

static void AppAI_ConfigureNpuRisafDefaults(void) {
	/* Keep the default ST security model so the AI runtime can reach the memory
	 * and fabric regions it expects during LL_ATON startup. */
	__HAL_RCC_RIFSC_CLK_ENABLE();
	__HAL_RCC_RISAF_CLK_ENABLE();

	
	AppAI_SetRisafDefault(RISAF2_S);
	

	
	AppAI_SetRisafDefault(RISAF3_S);
	

	
	AppAI_SetRisafDefault(RISAF4_S);
	

	
	AppAI_SetRisafDefault(RISAF5_S);
	

	
	AppAI_SetRisafDefault(RISAF6_S);
	

	
	AppAI_SetRisafDefault(RISAF7_S);
	

	/* RISAF12 programming currently stalls on this board even though the
	 * xSPI2 memory-mapped window is already enabled. Leave it untouched for
	 * now so we can validate whether the runtime can proceed without it. */
	

#if defined(RISAF8_S) && defined(RISAF15_S)
	
	AppAI_SetRisafDefault(RISAF8_S);
	AppAI_SetRisafDefault(RISAF15_S);
	
#endif
}

bool App_AI_RunDryInferenceFromYuv422(const uint8_t *frame_bytes,
		size_t frame_size) {
	const LL_Buffer_InfoTypeDef *rectifier_output_info = NULL;
	const LL_Buffer_InfoTypeDef *scalar_output_info = NULL;
	AppAI_RectifierBox rectifier_box = { 0.0f, 0.0f, 0.0f, 0.0f };
	AppAI_SourceCrop rectifier_crop = { 0U, 0U,
		(size_t) APP_AI_CAPTURE_FRAME_WIDTH_PIXELS,
		(size_t) APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS };
	AppAI_SourceCrop scalar_crop = { 0U, 0U, 0U, 0U };

	(void) DebugConsole_WriteString("[AI] Dry-run entry.\r\n");
	if (!App_AI_Model_Init()) {
		(void) DebugConsole_WriteString("[AI] Dry-run entry aborted during model init.\r\n");
		return false;
	}

	(void) DebugConsole_WriteString("[AI] Dry-run model init OK; launching rectifier stage.\r\n");

	if (!AppAI_RunStageInference(&app_ai_rectifier_stage, frame_bytes,
			frame_size, &rectifier_crop, &rectifier_output_info)) {
		(void) DebugConsole_WriteString("[AI] Dry-run entry aborted during rectifier stage.\r\n");
		return false;
	}

	if (!AppAI_DecodeRectifierCropBox(rectifier_output_info, &scalar_crop,
			&rectifier_box)) {
		return false;
	}

	AppAI_LogRectifierResult(rectifier_output_info, &rectifier_box);
	DebugConsole_Printf(
			"[AI] Rectifier crop: x=%lu y=%lu w=%lu h=%lu\r\n",
			(unsigned long) scalar_crop.x_min,
			(unsigned long) scalar_crop.y_min,
			(unsigned long) scalar_crop.width,
			(unsigned long) scalar_crop.height);

	if (!AppAI_RunStageInference(&app_ai_scalar_stage, frame_bytes, frame_size,
			&scalar_crop, &scalar_output_info)) {
		(void) DebugConsole_WriteString("[AI] Dry-run entry aborted during scalar stage.\r\n");
		return false;
	}

	AppAI_LogInferenceResult(scalar_output_info);

	return true;
}

/* USER CODE END 0 */

/* USER CODE BEGIN 1 */

static const LL_Buffer_InfoTypeDef *AppAI_GetInputBufferInfo(void) {
	const LL_Buffer_InfoTypeDef *input_info =
			LL_ATON_Input_Buffers_Info(
					&NN_Instance_scalar_full_finetune_from_best_piecewise_calibrated_int8);

	if ((input_info == NULL) || (input_info->name == NULL)) {
		return NULL;
	}

	return input_info;
}

static const LL_Buffer_InfoTypeDef *AppAI_GetOutputBufferInfo(void) {
	const LL_Buffer_InfoTypeDef *output_info =
			LL_ATON_Output_Buffers_Info(
					&NN_Instance_scalar_full_finetune_from_best_piecewise_calibrated_int8);

	if ((output_info == NULL) || (output_info->name == NULL)) {
		return NULL;
	}

	return output_info;
}

static const LL_Buffer_InfoTypeDef *AppAI_FindBufferInfoByName(
		const LL_Buffer_InfoTypeDef *buffer_list, const char *name) {
	if ((buffer_list == NULL) || (name == NULL)) {
		return NULL;
	}

	for (const LL_Buffer_InfoTypeDef *entry = buffer_list; entry->name != NULL;
			++entry) {
		if (strcmp(entry->name, name) == 0) {
			return entry;
		}
	}

	return NULL;
}

static const LL_Buffer_InfoTypeDef *AppAI_FindFirstBufferInfoByNames(
		const LL_Buffer_InfoTypeDef *buffer_list, const char *const *names,
		size_t name_count) {
	if ((buffer_list == NULL) || (names == NULL) || (name_count == 0U)) {
		return NULL;
	}

	for (size_t index = 0U; index < name_count; ++index) {
		const LL_Buffer_InfoTypeDef *buffer_info = AppAI_FindBufferInfoByName(
				buffer_list, names[index]);

		if (buffer_info != NULL) {
			return buffer_info;
		}
	}

	return NULL;
}

static void AppAI_LogInferenceResult(
		const LL_Buffer_InfoTypeDef *output_buffer_info) {
	const LL_Buffer_InfoTypeDef *internal_buffers = NULL;
	const LL_Buffer_InfoTypeDef *quantize_output_info = NULL;
	const LL_Buffer_InfoTypeDef *sub_output_info = NULL;
	const LL_Buffer_InfoTypeDef *conv1_output_info = NULL;
	const LL_Buffer_InfoTypeDef *raw_output_info = NULL;
	const LL_Buffer_InfoTypeDef *scale_info = NULL;
	const LL_Buffer_InfoTypeDef *zero_point_info = NULL;
	union {
		float f;
		uint32_t u;
	} output_bits = {
		.f = 0.0f
	};
	float output_value = 0.0f;
	float head_scale = 1.0f;
	float output_dequant_scale = 1.0f;
	float head_dequant_value = 0.0f;
	int8_t raw_output_value = 0;
	int8_t head_zero_point = 0;
	int8_t output_zero_point = 0;
	static const char *const quantize_output_names[] = {
		"Quantize_5_out_0",
		"Quantize_17_out_0",
	};
	static const char *const sub_output_names[] = {
		"Sub_13_out_0",
		"Sub_25_out_0",
	};
	static const char *const conv1_output_names[] = {
			"Conv2D_19_zero_off_out_22",
			"Conv2D_19_zero_off_out_28",
			"Conv2D_31_zero_off_out_34",
	};
	static const char *const raw_output_names[] = {
		"Gemm_259_out_0",
		"Gemm_260_out_0",
		"Gemm_322_out_0",
	};
	static const char *const scale_names[] = {
		"Dequantize_261_x_scale",
		"Dequantize_262_x_scale",
		"Dequantize_324_x_scale",
	};
	static const char *const zero_point_names[] = {
		"Dequantize_261_x_zero_point",
		"Dequantize_262_x_zero_point",
		"Dequantize_324_x_zero_point",
	};

	if (output_buffer_info == NULL) {
		DebugConsole_Printf("[AI] Inference failed: no output buffer.\r\n");
		return;
	}

	DebugConsole_Printf(
			"[AI] Output buffer meta: name=%s addr=%p len=%lu\r\n",
			(output_buffer_info->name != NULL) ? output_buffer_info->name : "(unnamed)",
			LL_Buffer_addr_start(output_buffer_info),
			(unsigned long) LL_Buffer_len(output_buffer_info));

	(void) memcpy(&output_bits.u, LL_Buffer_addr_start(output_buffer_info),
			sizeof(output_bits.u));
	output_value = output_bits.f;

	internal_buffers =
			LL_ATON_Internal_Buffers_Info(
					&NN_Instance_scalar_full_finetune_from_best_piecewise_calibrated_int8);
	quantize_output_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
			quantize_output_names, sizeof(quantize_output_names) / sizeof(
					quantize_output_names[0]));
	sub_output_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
			sub_output_names, sizeof(sub_output_names) / sizeof(
					sub_output_names[0]));
	conv1_output_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
			conv1_output_names, sizeof(conv1_output_names) / sizeof(
					conv1_output_names[0]));
	raw_output_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
			raw_output_names, sizeof(raw_output_names) / sizeof(
					raw_output_names[0]));
	scale_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
			scale_names, sizeof(scale_names) / sizeof(scale_names[0]));
	zero_point_info = AppAI_FindFirstBufferInfoByNames(internal_buffers,
			zero_point_names, sizeof(zero_point_names) / sizeof(
					zero_point_names[0]));

	AppAI_LogBufferInfoAndSignature("input tensor", quantize_output_info);
	AppAI_LogBufferInfoAndSignature("preprocess output", sub_output_info);
	AppAI_LogBufferInfoAndSignature("first conv", conv1_output_info);
	AppAI_LogBufferInfoAndSignature("raw head", raw_output_info);
	AppAI_LogBufferInfoAndSignature("network output", output_buffer_info);

	/* Dump the first 16 raw bytes of both the head output and the final network
	 * output so we can tell whether the inference engine wrote anything at all
	 * and whether the int8 value being read is actually at offset 0. */
	if ((raw_output_info != NULL) && (LL_Buffer_addr_start(raw_output_info) != NULL)) {
		const uint8_t *p = (const uint8_t *) LL_Buffer_addr_start(raw_output_info);
		const size_t n = LL_Buffer_len(raw_output_info);
		DebugConsole_Printf(
				"[AI] Scalar raw-head bytes (len=%lu): "
				"[%02X %02X %02X %02X %02X %02X %02X %02X "
				"%02X %02X %02X %02X %02X %02X %02X %02X]\r\n",
				(unsigned long) n,
				(n >  0U) ? p[0]  : 0U, (n >  1U) ? p[1]  : 0U,
				(n >  2U) ? p[2]  : 0U, (n >  3U) ? p[3]  : 0U,
				(n >  4U) ? p[4]  : 0U, (n >  5U) ? p[5]  : 0U,
				(n >  6U) ? p[6]  : 0U, (n >  7U) ? p[7]  : 0U,
				(n >  8U) ? p[8]  : 0U, (n >  9U) ? p[9]  : 0U,
				(n > 10U) ? p[10] : 0U, (n > 11U) ? p[11] : 0U,
				(n > 12U) ? p[12] : 0U, (n > 13U) ? p[13] : 0U,
				(n > 14U) ? p[14] : 0U, (n > 15U) ? p[15] : 0U);
	}
	if ((output_buffer_info != NULL) && (LL_Buffer_addr_start(output_buffer_info) != NULL)) {
		const uint8_t *p = (const uint8_t *) LL_Buffer_addr_start(output_buffer_info);
		const size_t n = LL_Buffer_len(output_buffer_info);
		DebugConsole_Printf(
				"[AI] Scalar network-output bytes (len=%lu): "
				"[%02X %02X %02X %02X %02X %02X %02X %02X "
				"%02X %02X %02X %02X %02X %02X %02X %02X]\r\n",
				(unsigned long) n,
				(n >  0U) ? p[0]  : 0U, (n >  1U) ? p[1]  : 0U,
				(n >  2U) ? p[2]  : 0U, (n >  3U) ? p[3]  : 0U,
				(n >  4U) ? p[4]  : 0U, (n >  5U) ? p[5]  : 0U,
				(n >  6U) ? p[6]  : 0U, (n >  7U) ? p[7]  : 0U,
				(n >  8U) ? p[8]  : 0U, (n >  9U) ? p[9]  : 0U,
				(n > 10U) ? p[10] : 0U, (n > 11U) ? p[11] : 0U,
				(n > 12U) ? p[12] : 0U, (n > 13U) ? p[13] : 0U,
				(n > 14U) ? p[14] : 0U, (n > 15U) ? p[15] : 0U);
	}

	if ((raw_output_info != NULL) && (LL_Buffer_addr_start(raw_output_info) != NULL)) {
		raw_output_value = *(const int8_t *) LL_Buffer_addr_start(raw_output_info);
	}

	{
		char raw_output_line[64] = { 0 };

		(void) snprintf(raw_output_line, sizeof(raw_output_line),
				"[AI] Raw output int8: %d\r\n", (int) raw_output_value);
		DebugConsole_WriteString(raw_output_line);
	}

