rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	DebugConsole_Printf(
			"[AI] Raw tensor meta: name=%s addr=%p len=%lu\r\n",
			(raw_output_info != NULL) ? raw_output_info->name : "(missing)",
			(raw_output_info != NULL) ? (void *) LL_Buffer_addr_start(raw_output_info) : NULL,
			(raw_output_info != NULL) ? (unsigned long) LL_Buffer_len(raw_output_info) : 0UL);

	if ((scale_info != NULL) && (LL_Buffer_addr_start(scale_info) != NULL)) {
		(void) memcpy(&output_dequant_scale, LL_Buffer_addr_start(scale_info),
				sizeof(output_dequant_scale));
	}

	if ((zero_point_info != NULL)
			&& (LL_Buffer_addr_start(zero_point_info) != NULL)) {
		output_zero_point = *(const int8_t *) LL_Buffer_addr_start(
				zero_point_info);
	}

	if (raw_output_info != NULL) {
		const void *raw_output_addr = LL_Buffer_addr_start(raw_output_info);

		if (raw_output_addr != NULL) {
			raw_output_value = *(const int8_t *) raw_output_addr;
			if ((raw_output_info->scale != NULL)
					&& (raw_output_info->offset != NULL)) {
				(void) memcpy(&head_scale, raw_output_info->scale,
						sizeof(head_scale));
				head_zero_point = *(const int16_t *) raw_output_info->offset;
			}
			head_dequant_value = ((float) raw_output_value
					- (float) head_zero_point) * head_scale;
		}
	}

	/* Log the model output before calibration so we can tell whether the
	 * network itself is changing or whether the postprocess fit is flattening
	 * the result into the same displayed value. */
	{
		char model_output_line[64] = { 0 };

		AppInferenceLog_FormatFloatMicros(model_output_line,
				sizeof(model_output_line),
				"[AI] Model output before calibration: ", output_bits.f);
		DebugConsole_WriteString(model_output_line);
	}
	output_value = AppInferenceCalibration_Apply(output_value);
	output_value = AppAI_FilterInferenceValue(output_value);

	/* Log both the final float output and the raw int8 tensor so we can spot
	 * quantization mismatches without changing the model result path. */
	DebugConsole_Printf(
			"[AI] raw=%d head_zp=%d output_bits=0x%08lx output_zp=%d\r\n",
			(int) raw_output_value,
			(int) head_zero_point,
			(unsigned long) output_bits.u,
			(int) output_zero_point);
	AppAI_LogFloatApprox("[AI] head_scale: ", head_scale);
	AppAI_LogFloatApprox("[AI] head_dequant: ", head_dequant_value);
	AppAI_LogFloatApprox("[AI] output_scale: ", output_dequant_scale);
	AppAI_LogFloatApprox("[AI] output_zero_point: ", (float) output_zero_point);
	AppAI_LogFloatApprox("[AI] Inference output value: ", output_value);

	app_ai_last_inference_value = output_value;
	app_ai_last_inference_valid = true;
}

/**
 * @brief Smooth the user-facing inference value across captures.
 *
 * The model already produces a stable underlying scalar, but the live camera
 * path still has a bit of frame-to-frame noise. A light EMA keeps the board
 * reading from jumping around while preserving slow changes.
 */
static float AppAI_FilterInferenceValue(float value) {
	if (!app_ai_inference_smoothing_initialized) {
		app_ai_inference_smoothed_value = value;
		app_ai_inference_smoothing_initialized = true;
		return value;
	}

	app_ai_inference_smoothed_value += APP_AI_INFERENCE_SMOOTHING_ALPHA
			* (value - app_ai_inference_smoothed_value);
	return app_ai_inference_smoothed_value;
}

static int AppAI_ApplyCacheRange(uint32_t start_addr, uint32_t end_addr,
		bool clean, bool invalidate) {
	uintptr_t start = 0U;
	uintptr_t end = 0U;

	if (end_addr <= start_addr) {
		return -1;
	}

	start = (uintptr_t) start_addr;
	end = (uintptr_t) end_addr;

	start &= ~((uintptr_t) APP_AI_CACHE_LINE_BYTES - 1U);
	end = (end + APP_AI_CACHE_LINE_BYTES - 1U)
			& ~((uintptr_t) APP_AI_CACHE_LINE_BYTES - 1U);

	if (clean) {
		SCB_CleanDCache_by_Addr((uint32_t *) start, (int32_t) (end - start));
	}

	if (invalidate) {
		SCB_InvalidateDCache_by_Addr((uint32_t *) start,
				(int32_t) (end - start));
	}

	return 0;
}

static bool AppAI_PreprocessYuv422FrameToFloatInput(const uint8_t *frame_bytes,
		size_t frame_size, float *input_ptr, size_t input_float_count) {
	const size_t source_width = (size_t) APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t source_height = (size_t) APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	size_t crop_x_min = 0U;
	size_t crop_y_min = 0U;
	size_t crop_width = source_width;
	size_t crop_height = source_height;
	bool crop_found = false;
	const char *crop_label = "fixed";

	if ((frame_bytes == NULL) || (input_ptr == NULL)) {
		
		return false;
	}

	if ((frame_size < (size_t) APP_AI_CAPTURE_FRAME_BYTES)
			|| (input_float_count < (size_t) APP_AI_MODEL_INPUT_FLOAT_COUNT)) {
		
		return false;
	}

	/* DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1 emits packed YUYV samples:
	 *   byte 0 = Y0, byte 1 = U, byte 2 = Y1, byte 3 = V, ...
	 * We estimate the gauge position from the bright dial face, crop around
	 * that box, and then resize with padding to match the model input. */
	if (app_ai_forced_crop_active) {
		crop_found = true;
		crop_label = (app_ai_forced_crop_label != NULL)
				? app_ai_forced_crop_label : "forced";
		crop_x_min = app_ai_forced_crop_x_min;
		crop_y_min = app_ai_forced_crop_y_min;
		crop_width = app_ai_forced_crop_width;
		crop_height = app_ai_forced_crop_height;
	} else {
#if APP_AI_USE_ADAPTIVE_GAUGE_CROP
		crop_found = AppAI_EstimateGaugeCropBoxFromYuv422(frame_bytes, frame_size,
				source_width, source_height, &crop_x_min, &crop_y_min,
				&crop_width, &crop_height);
#endif
		if (crop_found) {
			crop_label = "adaptive";
		}
	}
	if (!crop_found) {
		crop_x_min = (size_t) ((float) source_width
				* APP_AI_TRAINING_CROP_X_MIN_RATIO);
		crop_y_min = (size_t) ((float) source_height
				* APP_AI_TRAINING_CROP_Y_MIN_RATIO);
		crop_width = (size_t) ((float) source_width
				* (APP_AI_TRAINING_CROP_X_MAX_RATIO
				- APP_AI_TRAINING_CROP_X_MIN_RATIO));
		crop_height = (size_t) ((float) source_height
				* (APP_AI_TRAINING_CROP_Y_MAX_RATIO
				- APP_AI_TRAINING_CROP_Y_MIN_RATIO));
		if (crop_width == 0U) {
			crop_width = 1U;
		}
		if (crop_height == 0U) {
			crop_height = 1U;
		}
	}

	{
		char crop_line[128] = { 0 };

		(void) snprintf(crop_line, sizeof(crop_line),
				"[AI] Crop %s: x=%lu y=%lu w=%lu h=%lu\r\n",
				crop_label,
				(unsigned long) crop_x_min, (unsigned long) crop_y_min,
				(unsigned long) crop_width, (unsigned long) crop_height);
		DebugConsole_WriteString(crop_line);
	}

